[{"title":"第02章　纤手燃战火","date":"2017-01-21T13:58:09.000Z","path":"2017/01/21/wulinwaizhuan/第02章_纤手燃战火/","text":"七姑娘眼波转来转去，在他两人面上打转，冷冷的听他两人一搭一档，将话说完，突然娇笑道：“好，这样才像条汉子……” 徐若愚大喜，忖道：“金兄果然妙计。”口中道：“你既知如此，从今而后，便该莫再目中无人才是。”他胸膛虽然挺得更高，但语气却不知不觉有些软了。 七姑娘笑道：“我从今以后，可再也不敢小瞧两位了。” 徐若愚忍不住喜动颜色，展颜笑道：“好说好说。” 七姑娘娇笑道：“两位商量一阵，见我一个弱女子带着个小孩，怎会是两位的对手，于是软的不行就来硬的，要给我些颜色瞧瞧。这样能软能硬，见机行事的大英雄大豪杰，江湖上倒也少见得很，我怎敢小瞧两位。”她越说笑容越甜，徐若愚却越听越不是滋味，脸胀得血红，呆呆地怔在那里，方才的得意高兴，早已跑到九霄云外。 金不换冷冷道：“一个妇道人家，说话如此尖刻，行事如此狂傲，也难为你家大人是如何教导出来的。” 七姑娘道：“你可是要教训教训我？” 金不换道：“不错。你瞧徐兄少年英俊，谦恭有礼，就当他好欺负了？哼哼！徐兄对人虽然谦恭，但最最瞧不惯的，便是你这种人物。徐兄你说是么？” 徐若愚道：“嗯嗯……咳咳……” 七姑娘伸出纤手，拢了拢鬓角，微微笑道：“如此说来，就请动手呀。” 火孩儿一手拉着那落魄少年衣角，一面大声道：“就凭这吃耳光的小子，哪用姑娘你来动手。” 金不换道：“你两人一起上也没关系，反正……” 一张脸始终是阴阳怪气，不动神色的断虹子突然冷笑，截口道：“金不换，你可要贫道指点指点你？” 金不换干笑道：“在下求之不得。” 断虹子道：“‘活财神’家资亿万，富甲天下，但数十年来，却没有任何一个黑道朋友敢动他家一两银子，这为的什么，你可知道？” 金不换笑道：“莫非黑道朋友都嫌他家银子已放得发了霉不成？”越说越觉得意，方待放声大笑，但一眼瞧见断虹子铁青的面色，笑声在喉咙里滚了滚又硬生生咽了下去。 断虹子寒着脸道：“你不是不愿听么？哼哼，你不愿听贫道还是要说的，这只因昔日武林中有不少高人，有的为了避仇，有的为了避祸，都逃到‘活财神’那里，‘活财神’虽然视钱如命，但对这些人却是百依百顺，数十年来，活财神家实已成了卧虎藏龙之地。不说别人，就说今日随着朱姑娘来的这位小朋友，就不是好惹的人物。你要教训别人，莫要反被别人教训了。” 金不换指着火孩儿道：“道长说的就是她？” 断虹子道：“除她以外，这厅中还有谁是小朋友？” 金不换忍不住放声大笑道：“道长说的就是她？也未免太长他人志气，灭自己威风了！就凭这小怪物，纵然一生出来就练武功，难道还能强过中原武林七大高手不成？” 断虹子冷冷道：“你若不信，只管试试。” 金不换道：“自然要试试的。”掳起衣袖，便要动手。 雄狮乔五突也一卷衣袖，但袖子才卷起，便被花四姑轻轻拉住，悄悄道：“五哥你要做啥？” 乔五道：“你瞧这厮竟真要与小孩儿动手！哼哼，别人虽然不闻不问，但我乔五却实在看不上眼了。” 花四姑微笑道：“别人不闻不问，还可说是因那位七姑娘太狂傲，是以存心要瞧热闹，瞧她到底有多大本事。但是李老前辈亦是心安理得，袖手旁观，你可知道为了什么？难道他老人家也想瞧热闹不成？” 乔五皱眉道：“是呀，在下本也有些奇怪……” 花四姑悄声道：“只因李老前辈，已经对那穿着红衣裳的小朋友起了疑心，是以迟迟未曾出声拦阻。” 乔五大奇道：“她小小年纪，有何可疑之处？” 花四姑道：“我一时也说不清。总之这位小朋友，必定有许多古怪之处，说不定还是……唉！你等着瞧就知道了。” 乔五更是不解，喃喃道：“既是如此，我就等吧……” 只见金不换捋了半天衣袖，却未动手，反将徐若愚又拉到一旁．叽叽咕咕，也不知说的什么。再看李长青、断虹子、天法大师几人的目光，果然都在瞬也不瞬地望着那火孩儿，目光神色，俱都十分奇怪。 乔五瞧了那火孩儿两眼，暗中也不觉动了疑心，忖道：“这孩子为何戴着如此奇特的面具，却不肯以真面目示人？瞧他最多不过十一二岁，为何说话却这般老气？” 火孩儿只管拉着那落魄少年，落魄少年却是愁眉苦脸。七姑娘冷眼瞧了瞧金不换，眼波立刻转向落魂少年身上，再也没有离开。 金不换将徐若愚拉到一边，恨声道：“机会来了。” 徐若愚道：“什么机会？” 金不换道：“扬威露脸的机会。难道这你都不懂？快去将那小怪物在三五招之间击倒，也好教那目中无人的丫头瞧瞧你的厉害。” 徐若愚道：“但……但那只是个孩子，教我如何动手？” 金不换冷笑道：“孩子又如何？你听那鬼道人断虹子将她说得那般厉害，你若将她击倒，岂非大大露脸？” 徐若愚沉吟半晌，嘴角突然露出一丝微笑，摇头道：“金兄，这次小弟可不再上你的当了。” 金不换道：“此话怎讲？” 徐若愚道：“我若与那孩子动手，胜了自是理所应该，万一败了却是大大丢人，是以你不动手，却来唤我。” 金不换冷冷道：“你真的不愿动手？” 徐若愚笑道：“这露脸的机会，还是让给金兄吧。” 金不换目光凝注着他，一字字缓缓道：“你可莫要后悔。” 徐若愚道：“决不后悔。” 金不换叹了口气，冷笑道：“狗咬吕洞宾，不识好人心……”冷笑转过身子，便要上阵了。 徐若愚呆望着他，面上微笑也渐渐消失，转目又瞧了那位七姑娘一眼，突然轻唤道：“金兄，且慢。” 金不换头也不回，道：“什么事？” 徐若愚道：“还……还是让……让小弟出手吧。” 金不换道：“不行，你不是决不后悔的么？” 徐若愚满面干笑，讷讷道：“这……这……金兄只要今天让给小弟动手，来日小弟必定重重送上一份厚礼。” 金不换似是考虑许久，方自回转身子，道：“去吧。” 徐若愚大喜道：“多谢金兄。”纵身一掠而出。 金不换望着他背影，轻轻冷笑道：“看来还像个角色，其实却是个绣花枕头，一肚子草包，敬酒不吃，吃罚酒，天生的贱骨头。” 徐若愚纵身掠到大厅中央大声道：“徐某今日为了尊敬‘仁义庄’三位前辈，是以琴剑俱未带来，但无论谁要来赐教，徐某一样以空手奉陪。” 七姑娘这才自那落魄少年身上收回目光，摇头笑道：“这小子看来又被姓金的说动了……” 火孩儿将那落魄少年一直拉到七姑娘身前，道：“姑娘，你看着他，莫要放他走了，我去教训教训那厮。” 七姑娘撇了撇嘴冷笑道：“谁要看着他？让他走好了。”说话间却已悄悄伸出两根手指，勾住了落拓少年的衣袖。 落魄少年轻轻叹道：“到处惹事，何苦来呢？” 七姑娘道：“谁像你那臭脾气，别人打你左脸，你便将右脸也送给别人去打。我可受不了别人这种气。” 落魄少年苦笑道：“是是，你厉害……嘿，你惹了祸后，莫要别人去替你收拾烂摊子，那就是真的厉害了。” 七姑娘嗔道：“不要你管！你放心，我死了也不要你管。”转过头不去睬他，但勾着他衣袖的两根手指，仍是不肯放下。 只见火孩儿大摇大摆，走到徐若愚面前，上上下下，瞧了徐若愚几眼，嘻嘻一笑，道：“打呀，等什么？” 徐若愚沉声道：“徐某本不愿与你交手，但……” 火孩儿道：“打就打，哪用这许多罗嗦。”突然纵身而起，扬起小手一个耳光向徐若愚刮了过去。这一着毫无巧妙之处，但出手之快，却是笔墨难叙。 徐若愚幸好有了金不换前车之鉴，知道这孩子说打就打，是以早已暗中戒备，此刻方自拧身避开，否则不免又要挨上一掌。 火孩儿嘻嘻笑道：“果然有些门道。”口中说话，手里却未闲着，红影闪动间，──双小手，狂风般拍将出去，竟然全不讲招式路数，直似童子无赖打法一般的招式，招式之间，却偏偏瞧不出有丝毫破绽，出手之迫急，更不给对方半点喘息的机会。 徐若愚似已失却先机，无法还手，但身形游走闪动于红影之间，身法仍是从容潇洒，教人瞧得心里很是舒服。 “女诸葛”花四姑悄悄向乔五道：“你瞧这孩儿是否古怪？” 乔五皱眉道：“这样的打法，俺端的从未见过。” 花四姑道：“这正是教人无法猜得出她的武功来历。” 乔五奇道：“莫非说这孩子也大有来历不成？” 花四姑道：“没有来历的人，岂能将徐若愚逼在下风？” 乔五微微颔首，眉头皱得更紧。过了半晌，花四姑又自叹道：“这孩子纵不愿使出本门武功，但徐若愚如此打法，只怕也要落败了。” 乔五目光凝注，亦自颔首道：“徐若愚若非如此喜欢装模作样，武功只怕还可更进一层。” 原来徐若愚自命风流，就连与人动手时，招式也务求潇洒漂亮，难看的招式，他死了也不肯施出。火孩儿三掌拍来，左下方本有空门露出，花四姑与乔五俱都瞧在眼里，知道徐若愚此刻若是施出一招“铁牛耕地”，至少亦能平反先机。 哪知徐若愚却嫌这一招“铁牛耕地”身法不够潇洒花俏，竟然不肯使出，反而施出一招毫无用途的“风吹御柳”。 金不换连连摇头，冷笑道：“死要漂亮不要命……”但心中仍是极为放心，只因徐若愚纵难取胜，看来也不致落败。 花四姑喃喃道：“不知李老前辈可曾瞧出她的真相。” 转目望去，却见冷三扶着个满面病容的老人，不知何时已到了李长青身侧，目光也正在随着火孩儿身形打转，又不时与李长青悄悄交换个眼色。 李长青沉声道：“大哥可瞧出来了么？” 病老人齐智沉吟道：“看来有七成是了。” 雄狮乔五越听越糊涂，忍不住道：“到底是什么？” 花四姑叹了口气，道：“你瞧这孩子打来虽无半点招式章法，但出手间却极少露出破绽，若无数十年武功根基，怎敢如此打法？” 乔五皱眉道：“但……但她最多也不过十来岁年纪……” 花四姑截口道：“十来岁的孩子怎会有数十年武功根基，除非……她年纪本已不小，只是身子长得矮小而已，总是戴上个面具，别人便再也猜不出她究竟有多少年纪。” 乔五喃喃道：“数十年武功根基……身形长得如童子……”心念突然一动，终于想起个人来，脱口道：“是她。” 花四姑道：“看来有八成是了。” 乔五动容道：“难怪此人有多年未曾露面，不想她竟是躲在‘活财神’家里。”他瞧了天法大师一眼，语声压得更低：“不知天法大师可曾瞧出了她的来历？若也瞧出来了，只怕……” 花四姑道：“何止天法大师，就是柳玉茹、断虹子，若是真都瞧出她的来历，只怕也……”话声戛然而顿。 但见天法大师魁伟之身形，突然开始移动，沉肃的面容上，泛起一层紫气，一步步往徐若愚与火孩儿动手处走了过去。 七姑娘眼波四转，此刻放声喝道：“快。” 火孩儿方自凌空跃起，听得这一声“快”字，身形陡然一折，双臂微张，凌空翻身，直扑徐若愚。这一招不但变化精微，内蕴深厚，威力之猛，更是惊人。 李长青耸然变色，失声呼道：“飞龙式。” 呼声未了，徐若愚已自惊呼一声，仆倒在地。但他毕竟是成名人物，身 手端的矫健，此刻虽败不乱，“燕青十八翻”，身形方落地面，接连几个翻身， 已滚出数丈开外，接着一跃而起，身上并无伤损，只是痴痴的望着火孩儿，目 中满是惊骇之色。 七姑娘娇喝道：“走！”一手拉着那落魄少年，一手拉起火孩儿，正待冲将出去，突听一声佛号：“阿弥陀佛！”声如洪钟，震人耳鼓。宏亮的佛号声中，天法大师威猛的身形已挡住了他们的去路。他身形宛如山峰般峙立，满身袈裟，无风自动，看来当真是宝相庄严，不怒自威，教人难越雷池一步。 七姑娘话也不说，身形一转竟又待自窗口掠出，但人影闪动间，冷三、断虹子、柳玉茹、徐若愚、金不换，五人竟都展动身形，将他三人去路完全挡住，五人俱是面色凝重，隐现怒容。 落魄少年轻叹一声，悄然道：“你胆子也未免太大了吧？明知别人必将瞧出她的来历，还要将她带来这里。” 七姑娘幽幽瞧了他一眼，恨声道：“还不都是为了你！为了要找你，我什么苦都吃过，什么事都敢做。” 两句话功夫，天法大师、冷三等六人已展开身形将七姑娘、落魄少年、火孩儿三人团团围在中央。 七姑娘面上突又泛起娇笑，道：“各位这是做什么？” 天法大师沉声道：“姑娘明知，何苦再问。” 七姑娘回首道：“李二叔，瞧你的客人不放我走啦！在你老人家家里有人欺负我，你老人家不也丢人么？” 李长青瞧了齐智一眼，自己不敢答话。齐智目光闪动，一时间竟也未开口。事态显见已是十分严重。 群豪亦都屏息静气，等待着这江湖第一智者回答，只因人人都知道这老人一字千金，说出的话更是永无更改。过了半晌，只听齐智沉声道：“敝庄建立之基金，多蒙令尊慨捐，朱姑娘要来要去，谁也不得拦阻。” 七姑娘暗中松了口气，天法大师等人却不禁耸然变色。哪知齐智语声微顿，瞬即缓缓接道：“但与朱姑娘同来之人，却势必要留在此间，谁也不能带走。” 七姑娘眨了眨眼睛，故意指着那落魄少年，笑道：“你老人家说的可是他么？他可并未得罪过什么人呀？” 齐智道：“不是。” 七姑娘道：“若不是他，便只有这小孩子了。她只是我贴身的小丫头，你老人家要留她下来侍候谁呀？” 齐智面色一沉，道：“事已至此，姑娘还要玩笑。” 七姑娘道：“你老人家说的话，我不懂。” 齐智冷笑道：“不懂？……冷三，去将那张告示揭下，让她瞧瞧。”语声未了．冷三已自飞身而出。 七姑娘拉着落魄少年的手掌，已微微有些颤抖，但面上却仍然带着微笑，似是满不在乎。瞬息间冷三便又纵身而人，手里多了张纸，正与那落魄少年方才揭下的一模一样，只是更为残破陈旧。齐智伸手接了过来，仰首苦笑道：“这张告示在此间已贴了七年，不想今日终能将它揭下。” 七姑娘又自眨了眨眼晴，道：“这是什么？” 齐智道：“无论你是否真的不知，都不妨拿去瞧瞧。”反手已将那张纸抛在七姑娘足下。 七姑娘目光回转一眼，拾起了它，道：“你两人也跟着瞧瞧吧。”蹲下身子，将落魄少年与火孩儿俱都拉在一处，凑起了头。 只见告示上写的是：“花蕊仙，人称‘上天入地’，掌中天魔，乃昔日武林‘十三天魔’之一。自衡山一役后，十三天魔所存惟此一人而已。只因此人远在衡山会前，便已销声匿迹，江湖中无人知其下落。此人年约五十至六十之间，身形却如髫龄童子，喜着红衣，武功来历不详，似得六十年前五大魔宫主人之真传，平生不使兵刃，亦不施暗器，但轻功绝高，掌力之阴毒，武林中可名列第六，五台玉龙大师、华山柳飞仙、江南大侠谭铁掌等江湖一流高手，俱都丧生此人掌下。十余年前，武林中便风传此人已死于黄河渡口。惟此一年来，凡与此人昔日有仇之人，俱都在寅夜被人寻仇身遭惨死，全家老少无一活口，致死之伤，正是此人独门掌法，至今已有一百四十余人之多，只因此人含眦必报，纵是仇怨极小，她上天入地，亦不肯放过，‘仁义庄’主人本不知凶手是她，曾亲身检视死者伤口，证实无误。据闻此人幼年时遭遇极惨，曾被人拘于笼中达八年之久，是以身不能长而成侏儒，因而性情大变，对天下人俱都怀恨在心，尤喜摧残幼童，双手血腥极重，暴行令人发指，若有人能将之擒获，无论死活酬银五千两整，绝不食言。仁义庄主人谨启。” 七姑娘手中拿着这张告示，却是瞧也未瞧一眼，目光只是在四下悄悄窥望，只见门外八骑士，俱已下马，手牵马缰木立不动。天法大师等人，神情更是激动，似是恨不得立时动手，只是碍着“仁义庄”主人，是以强忍着心头悲愤。七姑娘目光转来转去，突然偷个空附在落魄少年耳边，耳语道：“今日我和她出不出得去，全在你了。” 落魄少年目光重落在告示上，缓缓道：“事已至此，我也无法可施。”声音白喉间发出，嘴唇却动也不动。 七姑娘恨声道：“你不管也要你管！你莫非忘了，是谁救你的性命？你莫非忘了，别人是如何对你的？” 落魄少年长叹一声，闭口不语。 只见七姑娘亦自长长叹了口气，缓缓站起身子，道：“这位掌中天魔，手段倒真的毒辣得很！” 齐智沉声道：“姑娘既然知道，如何还要维护于她？” 七姑娘瞧了那火孩儿一眼，叹道：“看来他们已将你看作那花蕊仙了。” 火孩儿道：“这倒是个笑话！” 七姑娘眼睛似笑非笑地看着那落魄少年，缓缓道：“不管是不是笑话，我都知道她七年来绝未离开过我身边一步，她若能到外面去杀人，你倒不妨砍下我的脑袋。”她这话虽是向大家说的，但眼睛却只是盯着那落魄少年，落魄少年干咳一声，垂下了头。 天法大师厉声道：“无论七年来凶杀之事是否花蕊仙所为，但玉龙师叔之血海深仇，本座今日再也不肯放过。” 柳玉茹大声道：“不错，我姑姑……我姑姑……”眼眶突然红了，顿着脚道：“谁要是敢不让我替死去的姑姑报仇，我……我就和他拼了。”她这话也像是对大家说的，但眼睛却也只是瞪着七姑娘一人。 金不换悄悄向徐若愚使了个眼色，徐若愚大声道：“徐某和花蕊仙虽无旧仇，但如此凶毒之人，人人得而诛之。” 火孩儿冷笑道：“手下败将，也敢放屁。” 徐若愚面上微微一红，金不换立刻接口道：“徐兄一时轻敌，输了半招，又算得什么？” 徐若愚道：“不错，徐某本看她只是个髫龄童子，怎肯真正施出煞手。” 七姑娘冷冷笑道：“她若真是‘掌中天魔’，你此刻还有命么？呸！自说白话，也不害臊。” 徐若愚脸又一红，金不换冷笑道：“不错，花蕊仙武功的确不弱。但为武林除害，我们也不必一对一与她动手。有仇的报仇，有怨的报怨，大伙儿一齐上，看她真的能上天入地不成？” 李长青长叹一声，道：“依我良言相劝，花夫人还是束手就缚的好。朱姑娘也不必为她说话了。” 七姑娘眼波转动，顿足道：“你老人家莫非真认她是花蕊仙么？” 李长青道：“咳……咳，你还要强辩？” 七姑娘道：“她若不是，又当怎的？” 金不换大声道：“你揭下她那面具，让咱们瞧瞧。她若真是个孩子，就让李老前辈向她赔礼。”他抢先说话，事若作对，他自家当然最是露脸；事若有错，也是别人赔礼，吃亏的事见钱眼开金不换是万万不会做的。 七姑娘跺足道：“好，就揭下来，让他们瞧瞧。” 火孩儿大声道：“瞧着！”喝声未了，突然反手揭下了那火红的面具。 众人目光动处，当真吃了一惊，那火红的面具下，白生生一张小脸，哪有半点皱纹，果真是童子模样，万万不会是五六十岁的老人。 七姑娘咯咯笑道：“各位瞧清楚了么，这孩子只是皮肤不好，吹不得风，才戴这面具，不想竟开了这么多成名露脸的大英雄们一个玩笑。”娇笑声中拉着落魄少年与火孩儿，大摇大摆走了出去。 群豪目定口呆，谁也不敢阻拦于她。只见七姑娘衣衫不住波动，也不知是被风吹的还是身子在抖，但一出厅门，她脚步便突然加快了。 突听齐智锐声喝道；“慢走……莫放她走了。” “慢走”两字喝出，七姑娘立刻离地掠起，却在落魄少年手腕上重重拧了一把，等到齐智喝道：“莫放她走。”七姑娘与火孩儿已掠到马鞍上，娇呼道：“小没良心的，我两人性命都交给你了。” 娇呼声中，天法大师与柳玉茹已飞身追出。他两人被齐智一声大喝，震得心头灵光一闪，闪电般想起了此事之蹊跷。此刻两人身形展动，掌上俱已满注真力。 七姑娘已掠上马鞍，但健马尚未扬蹄，怎比得武林七大高手之迅急，眼见万万无法冲出庄门的了。落魄少年失魂落魄般立在当地，但闻身后风声响动，天法大师与柳玉茹一左一右，已将自他身旁掠过。就在这间不容发的刹那之间，落魄少年叹息一声，双臂突然反挥而出，右掌骈起如刀，左掌藏在袖中，他虽未回头，但这一掌一袖，却俱都攻向天法大师与柳玉茹必救之处，恰似背后长了眼睛一般。 天法大师、柳玉茹顾不得追人先求自保，两人掌上本已满蓄真力，有如箭在弦上，此刻回掌击出，那是何等力道。 柳玉茹冷笑道：“你这是找死。”双掌迎上少年衣袖。天法大师面色凝重，吐气开声，右掌在前，左掌在后，双掌相击，赤红的掌心迎着了落魄少年之手背，只听“勃，勃”两声闷响，似是远山后密云中之轻雷，众人瞧得清楚，只道这少年在当世两大高手夹击之下，必将骨折尸飞。 哪知轻雷响过，柳玉茹竟脱口惊呼出声，窈窕的身子，竟被震得腾空而起，天法大师“登，登，登”连退七步，每一步踩下，石地上都多了个破碎的脚印，脚印越来越深，显见天法大师竟是尽了全力，才使得身形不致跌倒。再看那落魄少年，身形竟藉着这回掌一击之势，斜飞而出，双袖飘飘，夹带劲风，眼见便要飘出庄门之外。 七姑娘亦自打马出门，轻叱道：“起！”右臂反挥，火孩儿身形凌空直上，左手拉着七姑娘右掌，右手一探，却抓住了落魄少年的衣袖，健马放蹄奔出，火孩儿、落魄少年也被斜斜带了出去，两人身形犹自凌空，看来似一道被狂风斜扯而起的两色长旗。 群豪虽是满心惊怒，但见到如此灵妙之身法，却又不禁瞧得目瞪口呆，一时间竟忘了追出。只见柳玉茹凌空一个翻身，落在地面，胸膛仍是急剧起伏。 天法大师勉强拿桩站稳，面上忽青忽白，突然一咬牙关，嘴角却沁出了一丝鲜血。他方才若是顺势跌倒，也就罢了，万不该又动了争强好胜之心，勉强挺住。此刻但觉气血翻涌，受的内伤竟不轻。 这时八条大汉已掠上了那七匹健马，前三后四，分成两排，缓步奔出。他们并未放蹄狂奔，正是要以这两道人马结成之高墙，为主人挡住追骑，只因他们深知庄中的这些武林豪雄，对他们无论如何也下不了毒手。 齐智抓着李长青肩头，抢步而出，顿足道：“追，追！再迟就追不上了。”目光瞧着断虹子。 断虹子干咳一声，只作未听见。齐智目光转向徐若愚，徐若愚却瞧着金不换，金不换干笑道：“我两人与她又无深仇，追什么？” 这些人眼见落魄少年那般武功，天法大师与柳玉茹联手夹击，犹自不敌，此刻怎肯追出。齐智长叹一声，连连顿足，喃喃道：“七大高手若是同心协力，当可纵横天下，怎奈……怎奈都只是一盘散沙，可惜……可惜……” 雄狮乔五浓眉一挑，沉声道：“那人揭下面具，明明只是个髫龄童子，不知前辈为何还要追她？” 齐智叹道：“在她面具之下，难道就不能再戴上一层人皮面具？十三魔易容之术，本是天下无双的。” 乔五怔了一怔，恍然道：“原来如此……” 金不换算定此刻别人早已去远，立刻顿足道：“唉，前辈为何不早些说出……唉，徐兄，咱们追去吧。”拉起徐若愚，放足狂奔而出。 花四姑摇头轻笑道：“徐若愚被此人缠上，当真要走上霉运了。” 乔五道：“待俺上去瞧瞧。”一跃而去。 花四姑道：“五哥，你也照样会上当的……”但乔五已自去远，花四姑顿了顿足，躬身道：“前辈交代的事，晚辈绝不会忘记……”她显然极是关心乔五之安危，不等话说完，人已出门。一阵风吹过，又自霏霏落下雪来。 柳玉茹呆呆地出神了半晌，也不知心里想的什么，突然走到天法大师面前，道：“大师伤势，不妨事么？” 天法大师怒道：“谁受了伤？受伤的是那小子。” 柳玉茹叹道：“是……我五台、华山两派，不共戴天之仇人已被逸走，大师若肯与我联手，复仇定非无望，不知大师意下如何？” 天法大师厉声道：“本座从来不与别人联手。”袍袖一拂，大步而出，但方自走了几步，脚步便是个踉跄。 柳玉茹嘴角笑容一闪，赶过去扶起了他，柔声道：“风雪交集，大师可愿我相送一程？”天法大师呆了半晌，仰天长长叹息一声，再不说话。 风雪果然更大。齐智瞧着这七大高手，转眼间便走得一千二净，身上突然感到一阵沉重的寒意，紧紧掩起衣襟，黯然道：“武林人事如此……唉……”左手扶着冷三，右手扶着李长青，缓缓走回大厅中。 李长青道：“七大高手，虽然如此，但江湖中除了这七大高手外，也未必就无其他英雄。” 齐智道：“唉……不错……唉，风雪更大了，关上门吧……” 李长青缓缓回身，掩起了门户。只听风雪中隐约传来那冷三常醉的歌声：“风雪漫中州，江湖无故人，且饮一杯酒，天涯……咳……咳咳……天涯洒泪行……”歌声苍凉，满含一种肃索落魄之情。 李长青痴痴地听了半晌，目中突然落下泪来，久久不敢回身…… 金不换拉着徐若愚奔出庄门，向南而奔。徐若愚目光转处，只见蹄印却是向西北而去，不禁顿住身形，道：“金兄，别人往西北方逃了，咱们到南边去追什么？” 金不换大笑道：“呆子，谁要去追他们？咱们不过是借个故开溜而已。再呆在这里，岂非自讨无趣么？” 徐若愚身不由主，又被他拉得向前直跑，但口中还是忍不住大声道：“说了去追，好歹也该去追一程的。” 金不换冷笑道：“徐兄莫非未瞧见那少年的武功？我两人纵然追着了他们，又能将人家如何？” 徐若愚叹了口气，说道：“那少年当真是真人不露相，想不到武功竟是那般惊人，难怪七姑娘要对他……对他那般模样了。” 金不换眯起眼睛笑道：“徐兄话里怎的有些酸溜溜的？” 徐若愚脸一红，强辩道：“我……我只是奇怪他的来历。” 金不换道：“无论他有多高武功，无论他是什么来历，但今日他实已犯了众怒，仁义三老、天法大师，迟早都放不过他去……”话声未了，雪花飞卷中，突见十余骑，自南方飞驰而来，马上人黑缎风氅，被狂风吹得斜斜飞起，骤眼望去，宛如一片乌云贴地卷来。金不换眼睛一亮，笑道：“这十余骑人强马壮，风雪中如此赶路，想必有着急事，看来我的生意又来了。”说话间十余匹马已奔到近前，当先一匹马，一条黑凛凛铁塔般的虬髯大汉，扬起丝鞭，厉叱道：“不要命了么？闪开。” 金不换横身立在道中，笑嘻嘻道：“我金不换正是不想活了，你就行个好把我踩死吧。” 虬髯大汉丝鞭停在空中，呼啸一声，十余骑俱都硬生生勒住马缰。虬髯大汉纵身下马，陪笑道：“原来是金大侠，展某着急赶路，未曾瞧见侠驾在此，多有得罪，该死该死。”双手抱拳，深深一揖。 金不换目光上上下下瞧了几眼，笑道：“我当是谁，原来是威武镖局的展英松总镖头。总镖头如此匆忙，敢情是追强盗么？” 展英松叹道：“展某追的虽非强盗，却比强盗还要可恶。不瞒金大侠，威武镖局虽不成气候，但蒙两河道上朋友照顾，多年来还未失过风，哪知昨夜竞被个丫头无缘无故摘了镖旗。展某虽无能，好歹也要追着她，否则威武镖局这块字号还能在江湖混么？” 金不换目光转了转，连瞎了的那只眼睛都似发出了光来，微微笑道：“总镖头说的可是个穿白衣服的大姑娘，还有个穿红衣服的小丫头？” 展英松神情一振，大喜道：“正是！金大侠莫非知道她们的下落？” 金不换不答话，只是瞧着展英松身上的黑缎狐皮风氅，瞧了几眼，叹着气道：“总镖头这件大氅在哪里买的，穿起来可真威风。赶明儿我要发了财，咬着牙也得买它一件穿穿。” 展英松呆了一呆，立刻将风氅脱了下来，双手捧上，赔笑道：“金大侠若不嫌旧，就请收下这件……” 金不换笑道：“这怎么成？这怎么敢当？”口中说话，手里却已将风氅接了过来。 展英松干咳着，说道：“这区区之物算得什么？金大侠若肯指点一条明路，展某日后必定还另有孝敬……” 金不换早已将风氅披在身上，这才遥指西北方，道：“大姑娘、小丫头都往那边去了，要追，就赶快吧。” 展英松道：“多谢。”翻身上马，呼啸声中，十余骑又如乌云般贴地向北而去。 徐若愚看得直皱眉头，摇首叹道：“金兄有了那少年的皮裘，再穿上这风氅，不嫌太多了么？” 金不换哈哈笑道：“不多不多！我金不换无论要什么，都只会嫌少，不会嫌多……咦，奇怪，又有人来了。” 徐若愚抬头看去，只见风雪中果然又有十余骑联袂飞奔而来。这十余骑马上骑士，有的身穿锦衣皮袍，有的急装劲服，声势看来远不及方才那十余骑威风，但是健马还远在数丈开外，马上便已有人大呼道：“前面道中站着的，可是‘见义勇为’金大侠么？”几句话呼完，马群便已到了近前。 徐若愚暗惊忖道：“此人好锐利的目光。”只见那喊话之人，身躯矮小，须发花白，穿着件长仅及膝的丝棉袍子，看来毫不起眼，直似个三家村的穷秀才，惟有一双目光却是炯炯有神，亮如明星。 金不换格格笑道：“七丈外，奔马背上都能看清楚我的模样，武林中除了‘神眼鹰飞’方千里外还有谁呢？” 矮老人已自下马，拂须大笑说道：“多年不见，一见面金兄就送了顶高帽子过来，不怕压死了小弟么？” 金不换目光一扫，道：“难得难得，想不到除了方兄外，扑天雕李挺丰大侠、穿云雁易如风易大侠也都来了。” 左面马上一条身形威猛之白发老人，右边马上一条身穿锦袍，颔下五绺长髯的颀长老人，也俱都翻身下马，抱拳含笑道：“金兄久违了。” 金不换道：“江湖人言，风林三鸟自衡山会后，便已在家纳福，今日老兄弟三个全都出动，难道是出来赏雪么？” 矮老人方千里叹道：“我兄弟是天生的苦命，一闲下来，就穷得差点没饭吃，只好扬起大竿子，开场收几个徒弟，骗几个钱吃饭，苦捱了好几年，好容易等到大徒弟也学会几手庄稼把式去骗人，我们三块老骨头就想偷个懒，把场子交给了他们。只道从此可以安安稳稳地坐在家里收钱，哪知……唉，昨天晚上不知从哪里钻出来个疯丫头，无怨无仇，平白无故的竟将那场子给挑了，还说什么七姑娘看不得这种骗人的把式。” 金不换、徐若愚对望一眼，心里又是好气，又觉好笑，忖道：“原来那位七姑娘竟是个专惹是非的闯祸精。” 方千里叹了口气，又道：“我的几个徒弟也真不成材，竟被那个疯丫头打得东倒西歪哭哭啼啼地回来诉苦。咱们三块老废料，既然教出了这些小废料，好歹也要替他们出口气呀，没法子，这才出来，准备就算拼了老命，也得将那疯丫头追上，问问她为什么要砸人饭碗？” 徐若愚不等金不换说话，赶紧伸手指着西北方，大声道：“那些人都往那边去了，各位就快快追去吧。” 方千里上下瞧了他一眼，道：“这位是……” 金不换冷笑道：“这位是挡人财路徐若愚，方兄未见过么？” 方千里怔了怔笑道：“徐若愚？莫非是‘玉面瑶琴神剑手’徐大侠……”微一抱拳，又道：“多蒙徐兄指点，我兄弟就此别过。”一掠上马，纵骑而去。 金不换斜眼瞧着徐若愚，只是冷笑。徐若愚强笑道：“小弟并非是挡金兄的财路，只是看他们既未穿着风氅，也不似带着许多银子，不如早些将他们打发了。” 金不换独眼眨了两眨，突然笑道：“别人挡我财路，那便是我金不换不共戴天的大仇人，但是徐兄么……哈哈，自己兄弟，还有什么话说？”大笑几声，拉起徐若愚，竟要回头向西北方奔去。 徐若愚奇道：“金兄为何又要追去了？” 金不换笑道：“有了展英松与‘风林三鸟’他们打头阵，已够他们受的，咱们跟过去瞧瞧热闹有何不可？” 突听远远道旁一株枯树后有人接口笑道：“说不定还可混水摸鱼，趁机捡点便宜，是么？”‘巧手兰心女诸葛’花四姑，随着笑声，自树后转出，她身旁还站着雄狮般一条铁汉，瞪眼瞧着金不换，却正是雄狮乔五。 金不换面色微变，但瞬即哈哈笑道：“不想雄狮今日也变成了狸猫，行路竞如此轻捷，倒险些吓了小弟一跳。”他明明要骂乔五行动鬼祟，却绕了个弯子说出，当真是骂人不带脏字。 乔五面容突然紫涨，怒道：“你……你……”盛怒之下，竟说不出话来。 金不换更是得意，又大笑道：“两位前来，不知有何见教？” 花四姑微微笑道：“咱们只是赶来关照徐少侠一声，劝他莫要被那些见利忘义的小人缠上了。” 金不换故意装作听不懂她骂的是自己，反而大笑道：“花四姑如此好心，确是令人可敬……”瞧了徐若愚一眼，“但徐兄明明久走江湖，是何时变作处处要人关照的小孩子，却令小弟不解。” 徐若愚亦自涨红了脸，突然大声道：“徐某行事，自家会作得主，用不着两位赶来关照。” 花四姑轻叹一声，还未说话，金不换已拍掌笑道：“原来徐兄自有主意，两位又何苦吹皱了一池春水？” 雄狮乔五双拳紧握，却被花四姑悄悄拉了拉衣袖。 金不换笑道：“两位何时变得如此亲热，当真可喜可贺！来日大喜之时，切莫忘了请老金喝杯喜酒啊。”大笑声中，拉着徐若愚一掠而去。 乔五怒喝一声，便待转身扑将上去，怎奈花四姑拉着他竟不肯放手，只听徐若愚遥遥笑道：“这一对倒真是郎才女貌……” 乔五顿足道：“那厮胡言乱语，四姑你莫放在心上。” 花四姑微微笑道：“我怎会与他一般见识。” 乔五仰天叹道：“堂堂武林名侠，竟是如此卑鄙的小人……哦。”寒风过处，远处竟又有蹄声随风传来。 花四姑喃喃道：“难道又是来找那位朱姑娘霉气的么……” 朱七姑娘打马狂奔，火孩儿拉着那落魄少年死也不肯放手，一骑三人，片时间便出半里之遥。七条大汉，亦已随后赶来，朱七姑娘这才收住马势，回眸笑道：“你露了那一手，我就知道没有人敢追来了。” 落魄少年坐在马背上，不住摇头，叹道：“朱七七，你害苦我了。” 朱七七柔声笑道：“今日你救了她，她绝不会忘记你的。喂，你说你忘得了沈浪么？” 火孩儿笑道：“忘不了，再也忘不了。” 朱七七嫣然笑道：“非但她忘不了，我也忘不了。” 落魄少年沈浪叹道：“我倒宁可两位早些忘了我！两位若再忘不了我，我可真要被你们害死了。” 火孩儿笑道：“我家姑娘喜欢你还来不及，怎会害你？” 沈浪道：“好了好了，你饶了我吧。”面色突然一沉：“我且问你，你明明不是花蕊仙，却为何偏偏要他们将你当花蕊仙？” 朱七七眨了眨眼睛，道：“谁说她不是花蕊仙？” 沈浪苦笑道：“她若是‘掌中天魔’，徐若愚还有命么？她若是‘上天入地’，临走时还要我挡那一掌？七姑娘，你骗人骗得够了，却害我无缘无故背上那黑锅，叫天法大师恨我入骨。” 火孩儿咯咯笑道：“我未来前，便听我家七姑娘夸奖沈公子如何如何，如今一见，才知道沈公子果然是不得了，了不得，那号称‘天下第一智’的老头子，当真给沈公子提鞋都不配。”他一面说话，一面将火红面具揭下，露出那白生生的孩儿脸，仔细一瞧，果然是张人皮面具。 火孩儿随手一抹，又将这人皮面具抹了下来，里面却竟还是张孩儿脸，但却万万不是人皮面具了。只见这张脸白里透红，红里透白，像个大苹果，教人恨不得咬上一口。两只大眼睛滴溜乱转，笑起来一边一个酒窝。 望着沈浪抱拳一揖，笑道：“小弟朱八，爹爹叫我喜儿，姐姐叫我小淘气，别人却叫我火孩儿。沈大哥你要叫我什么，随你便吧，反正我朱八已服了你了。” 沈浪虽然早巳猜得其中秘密，此刻还是不禁瞧得目瞪口呆，过了半晌，方自长叹一声道：“原来你也是朱家子弟。” 朱七七笑得花枝乱颤，道：“我这宝贝弟弟，连我五哥见了他都头疼，如今竟服了你，倒也难得的很。” 沈浪叹道：“这也算淘气么？这简直是个阴谋诡计！花蕊仙不知何处去了，却叫你八弟故弄玄虚，定要使人人都将他当作花蕊仙才肯走……唉！那一招‘天魔飞龙式’更是使得妙极，连齐智那般人物都被骗了。” 火孩儿笑嘻嘻道：“天魔十三式中，我只会这一招，那胡拍乱打的招式，才是我的独门功夫。” 沈浪苦笑道：“你那胡拍乱打的招式，可真害死了人。若非这些招式，齐智怎会上当……但我却要问你，这李代桃僵之计中，究竟有何文章？花蕊仙哪里去了？你们既将我卷在里面，我少不得要问个清楚。” 火孩儿道：“这个我可说不清，还是七姐说罢。” 朱七七轻叹道：“不错，这的确是个李代桃僵，金蝉脱壳之计，教别人都将老八当做花蕊仙，那么花蕊仙在别处做的事，就没有人能猜得到是谁做的……但你只管放心，花蕊仙此番去做的事，绝没有半点对不起人的，她只是要去捉弄那连天云，出出昔日的一口怨气。” 沈浪皱眉道：“连天云慷慨仗义，豪气如云，仁义三老中以他最是侠义，花蕊仙若是与他有怨，却是花蕊仙的错了。” 朱七七道：“这次却是你错了。” 沈浪道：“你处处维护着花蕊仙，竟说她已有十余年未染血腥，将我也说得信了，谁知七年前还有一百四十余人死在她手里。” 朱七七叹道：“这两件事，就是一件事。” 沈浪道：“你能不能说清楚些。” 朱七七道：“花蕊仙已有十一年未离堡中一步，八弟也有十一岁了，你不信可以问问他，我是否骗你。” 火孩儿道：“我天天缠着她，她怎么走得了？” 沈浪皱眉道：“她若真是十一年未离过朱家堡，七年前那一百四十余条性命，却又该着落在谁手里？” 朱七七叹道：“怪就怪在这里。那一百多人，不但都真的是花蕊仙的仇家，而且杀人的手法，也和花蕊仙所使的掌功极为近似，再加上沧州金振羽金家大小十七口，于一夜间全遭惨死后，连天云与那冷三连夜奔往实地勘查，更咬定了凶手必是花蕊仙。他们说的话，武林中人，自更是深信不疑。 但花蕊仙那天晚上，却明明在家和我们兄妹玩了一夜状元红，若说她能分身到沧州去杀人，那当真是见鬼了。” 沈浪动容道：“既是如此，你等便该为她洗清冤名。” 朱七七叹道：“花蕊仙昔年凶名在外，我们说话，分量远不及连天云重，为她解释，又怎能解释得清？” 沈浪皱眉道：“这话也不错。” 朱七七道：“连天云既未亲眼目睹，亦无确切证据，便判定别人罪名，不但花蕊仙满腹怨气，就连我姐弟也大是为她不平，早就想将连天云教训教训，怎奈始终对他无可奈何，直到这次……” 她嫣然一笑，接口又道：“这次我们才想出个主意，叫花蕊仙在后面将连天云引开，以‘天魔移踪术’，将他捉弄个够，而且还故意现现身形，教连天云瞧上一眼，连天云狼狈而归，必定要将此番经过说出，但是李长青与齐智却明明瞧见我八弟这小天魔在前厅闹得天翻地覆，对连天云所说的话，怎能相信？连天云向来自命一字千金，只要说出话来，无人不信，这下却连他自家兄弟都不能相信了，连天云岂非连肚子都要被生生气破？” 马行虽已缓，但仍在冒雪前行，说话间又走了半里光景。 突听道旁枯树上一人咯咯笑道：“他非但肚子险些气破了，连人也几乎被活活气死。”语声尖锐，如石击铁。 沈浪转目望去，只见枯树积雪，哪有人影，但是仔细一瞧，枯树上竟有一片积雪活动起来，飘飘落在地下，却是个满身红衣，面戴鬼脸，不但打扮得与火孩儿毫无两样，便是身形也与他相差无几的红衣人，只是此人红衣外罩着白狐皮风氅，方才缩在树上，将风氅连头带脚一盖，便活脱脱是片积雪模样，那时连天云纵然在树下走过，也未必能瞧得出她。 沈浪叹道：“想必这就是‘天魔移踪术’中的‘五色护身法’了，我久已闻名，今日总算开了眼界了。” 红衣人花蕊仙笑道：“区区小道，说穿了不过是一些打又打不得，跑也跑不快的小虫小兽身上学得来的，沈公子如此夸奖，叫我老婆子多不好意思？” 这保护之色，果真是天然淘汰中一些无能虫兽防身护命之本能，花蕊仙这番话倒委实说得坦白得很。 朱七七笑道：“不想你竟早已在这儿等着，事可办完了？” 花蕊仙道：“这次那连天云可真吃了苦头，我老婆子……” 突然间，寒风中吹送来一阵急骤的马蹄声。朱七七皱眉道：“是谁追来了？” 花蕊仙道：“不是展英松，就是方千里。” 沈浪奇道：“展英松、方千里为何要追赶于你？” 花蕊仙咯咯笑道：“这可又是咱们七姑娘的把戏，无缘无故的，硬说瞧那镖旗不顺眼，非把它拔下来不可。” 朱七七娇笑道：“可不是我动手拔的。” 火孩儿眼睛瞪得滚圆，大声道：“是我拔的又怎样？那些老头儿追到这里，看朱八爷将他们打个落花流水。” 花蕊仙笑道：“好了好了，本来只有一个闯祸精，现在赶来个捣蛋鬼，姐弟两人，正好一搭一档，沈相公，你瞧这怎生是好？” 沈浪抱拳一揖，道：“各位在这里准备厮打，在下却要告辞了。”自马后一掠而下，往道旁纵去。 火孩儿大呼道：“沈大哥莫走。” 朱七七眼眶又红了，幽幽叹道：“让他走吧。咱们虽然救过他一次性命，却也不能一定要他记着咱们的救命之恩！”语声悲悲惨惨，一副自艾自怨，可怜兮兮的模样。 沈浪顿住身形，跺丁跺脚，翻身掠回，长叹道：“姑奶奶，你到底要我怎样？” 朱七七破颜一笑，轻轻道：“我要你……要你……”眼波转了转，突然轻轻咬了咬樱唇，娇笑着垂下头去。 风雪逼人，蹄声越来越近，她竟似丝毫也不着急。花蕊仙有些着急了，叹道：“姑奶奶，这不是撒娇的时候，要打要逃，却得赶快呀。” 火孩儿道：“自然要打，沈大哥也帮着打。” 沈浪缓缓踱步沉吟道：“打么？……”走到火孩儿身前，突然出手如风，轻轻拂了他的肩井穴。 火孩儿但觉身子一麻，沈浪拦腰抱起了他，纵身掠上朱七七所骑的马背，反手一掌，拍向马屁股，健马一声长嘶，放蹄奔去。 花蕊仙也只得追随而去。八条大汉惟朱七七马首是瞻，个个纵鞭打马，花蕊仙微一挥手，身子已站到一匹马的屁股上，马上那大汉正待将马让给她，花蕊仙却道：“你走你的，莫管我。”她身子站在马上，当真是轻若无物，那大汉又惊又佩，怎敢不从。 火孩儿被沈浪挟在腋下，大叫大嚷：“放下我，放下我！你要是再不放下我，我可要骂了。” 沈浪微笑道：“你若再敢胡闹，我便将你头发削光，送到五台山去，叫你当天法大师座前的小和尚。” 火孩儿睁大了眼睛道：“你……你敢？” 沈浪道：“谁说我不敢？你不信只管试试。” 火孩儿倒抽了口冷气，果然再也不敢闹了。 朱七七笑道：“恶人自有恶人磨，想不到八弟也有服人的一天，这回你可遇着克星了吧。” 火孩儿道：“他是我姐夫，又不是外人，怕他就怕他，有什么大不了的！姐夫，你说对么？” 沈浪苦笑，朱七七笑啐道：“小鬼，乱嚼舌头，看我不撕了你的嘴。” 火孩儿做了个鬼脸，笑道：“姐姐嘴里骂我，心里却是高兴得很。” 朱七七娇笑着，反过身来，要打他，但身子一转，却恰好扑入沈浪怀里。 火孩儿大笑道：“你们看，姐姐在乘机揩油了……” 只听风雪中远远传来叱咤之声，有人狂呼道：“蹄印还新，那疯丫头人马想必未曾过去许久。” 要知风向西北而吹，是以追骑之蹄声被风送来，朱七七等人远远便可听到，而追骑却听不到前面的蹄声人语。沈浪打马更急，朱七七道；“说真个的，咱们又不是打不过他们，又何必逃得如此辛苦。” 沈浪道：“我也不是打不过你，为何不与你厮打？” 朱七七娇嗔道：“嗯……人家问你真的，你却说笑。” 沈浪叹道：“我何尝不是真的？须知你纵是武功较人强上十倍，这架还是打不得的。” 朱七七道：“有何不能打？” 沈浪道：“本是你无理取闹，若再打将起来，岂不令江湖朋友耻笑？何况那展英松与方千里，也不是什么好惹的人物，你若真是与他们结下不解之仇，日后只怕连你爹爹都要跟着受累。” 朱七七嫣然一笑道：“如此说来，你还是为着我的。” 沈浪苦笑道：“救命之恩，怎敢不报。” 朱七七轻轻叹了口气，索性整个身子都偎入沈浪怀里，轻轻道：“好。逃就逃吧，无论逃到何时，都由得你。” 火孩儿吱吱怪笑道：“哎哟，好肉麻……” 一行人沿河西奔，自陇城渡河，直奔至沁阳，才算将追骑完全摆脱，已是人马俱疲，再也难前行一步。这时已是第二日午刻，风雪依旧。还未到沁阳，朱七七已连声叹道：“受不了，受不了，再不寻家干净客栈歇歇，当真要命了。” 沈浪道：“此地只怕还歇不住，会有追骑赶来。” 朱七七直着嗓子嚷道：“追骑赶来？此刻我还管追骑赶来？就是有人迫上来，把我杀了，割了，宰了，我也得先好生睡一觉。” 沈浪皱眉喃喃道：“到底是个娇生惯养的千金小姐……” 朱七七道：“你说什么？” 沈浪叹了口气，道：“我说是该好生歇歇了。” 火孩儿做了个鬼脸诡笑道：“他不是说的这个，他说你是个娇生惯养的千……”语声突然顿住，眼睛直瞪着道路前方，再也不会转动。 这时人马已人城，沁阳房屋市街已在望，那青石板铺成的道路前方，突然蜿蜒转过一道长蛇般的行列。一眼望去，只见数十条身着粗布衣衫，敞开了衣襟的精壮汉子，抬着十七八口棺材，笔直走了过来。大汉们满身俱是煤灰泥垢，所抬的棺材，却全都是崭新的，甚至连油漆都未涂上，显然是匆忙中制就，看来竟仿佛是这沁阳城中，新丧之人太多，多得连棺材都来不及做了。 道路两旁行人，早已顿住脚步，却无一人对这奇异的出丧行列瞧上一眼。有的低垂目光，有的回转头去，还有的竟躲人道旁的店家，似乎只要对这棺材瞧上一眼，便要惹来可怖的灾祸。 火孩儿瞧得又是惊奇，又是诧异，连眼珠子都已瞧得不会动了，过了半晌才叹出口气，道：“好多棺材。” 朱七七道：“的确不少。” 火孩儿道：“什么不少，简直太多了。这么多棺材同时出丧，我一辈子也未见过！嘿嘿，只怕你也未见过吧？” 朱七七皱眉道：“如此多人，同时暴卒，端的少见得很。瞧别人躲之不及的模样，这里莫非有瘟疫不成？” 火孩儿道：“如是瘟疫死的，尸首早已被烧光了。” 朱七七道：“如非瘟疫，就该是武林仇杀，才会死这么多人，但护送棺材的人，却又没有一个像是江湖豪杰的模样。” 火孩儿道：“所以这才是怪事。” 花蕊仙早已过来。她面上虽仍戴着面具，但别人只当顽童嬉戏，致未引人注目。 朱七七转首问她：“你可瞧得出这是怎么回事？” 花蕊仙道：“不管怎样，这沁阳必是个是非之地，咱们不如……”她还未说出要走的话来。 朱七七却已瞪起眼睛，道：“是非之地又如何？” 花蕊仙道：“没有什么。”轻轻叹了口气，喃喃道：“是非之地，又来了两个专惹是非的角色……唉，只怕是要有热闹瞧了。” 朱七七只当没有听见。只要沈浪不说话，她就安心得很。待棺材一走过，她立刻纵上了长街。 只见街上一片寂然，人人俱是闭紧嘴巴，垂首急行。方才的行列虽是那般奇异，此刻满街上却连个窃窃私议的人都没有。这显然又是大出常情之事，但朱七七也只当没有瞧见，寻了个客栈，下马打尖。 那客栈规模甚大，想必是这沁阳城中最大的一家。此刻客栈冷冷清清，连前面的饭庄都寂无一人。已来到沁阳的行商客旅，都似乎已走得干干净净；还没有来的，也似乎远远就绕道而行，这“沁阳”此刻竟似已变成了个“凶城”。 傍晚时朱七七方自一觉醒来。她虽然睡了一下午，却并未睡得十分安稳，睡梦之中，她仿佛听到外面长街之上，有马蹄奔腾，往来不绝。此刻她一睡醒，别人可也睡不成了。 匆匆梳洗过，她便赶到隔壁一间屋外，在窗外轻轻唤道：“老八，老……” 第二声还未唤出口来，窗子就已被推开，火孩儿穿了一件火红短袄，站在临窗一张床上，笑道：“我算准你也该起来了。” 朱七七悄声道：“他呢？” 火孩儿皱了皱鼻子，道：“你睡得舒服，我可苦了，简直眼睛都不敢合，一直盯着他，他怎么走得了，你瞧，还睡得跟猪似的哩。” 朱七七道：“不准骂人。”眼珠子一转，只见对面床上，棉被高堆，沈浪果然还在高卧。朱七七轻笑道：“不让他睡了，叫醒他。” 火孩儿笑道：“好。”凌空一个筋斗，翻到对面那张床上，大声道：“起来起来，女魔王醒来了，你还睡得着么？” 沈浪却真似睡死一般，动也不动。 火孩儿喃喃道：“他不是牛，简直有些像猪了……”突然一拉棉被，棉被中赫然还是床棉被，哪有沈浪的影子？ 朱七七惊呼一声，越窗而人，将棉被都翻到地上，枕头也甩了，顿足道：“你别说人家是猪，你才是猪哩！你说没有合眼睛，他难道变个苍蝇飞了不成？……来人呀，快来人呀……” 花蕊仙、黑衣大汉们都匆匆赶了过来，朱七七道：“他……他又走了……”一句话未说完，眼圈已红了。 火孩儿被朱七七骂得噘起了小嘴，喃喃地道：“不害臊，这么大的人，动不动就要流眼泪，哼，这……” 朱七七跳了起来，大叫道：“你说什么？” 火孩儿道：“我说……我说走了又有什么了不得，最多将他追回来就是。” 朱七七道：“快，快去追！追不回来，瞧我不要你的小命……你们都快去追呀，瞪着眼发啥呆？只怕……只怕这次再也追不着了。”突然伏在床上，哭了起来。 火孩儿叹了口气道：“追吧……” 突见窗外人影一闪，沈浪竟飘飘地走了进来。 火孩儿又惊又喜，扑过去一把抓住了他，大声道：“好呀，你是什么时候走的？害得我挨骂。” 沈浪微微笑道：“你在梦里大骂金不换时，我走的……”","tags":[{"name":"武林外传","slug":"武林外传","permalink":"http://jishusuishouji.github.io/tags/武林外传/"}]},{"title":"第01章　风雪漫中州","date":"2017-01-21T12:39:32.000Z","path":"2017/01/21/wulinwaizhuan/第01章_风雪漫中州/","text":"怒雪威寒，天地肃杀，千里内一片银白，几无杂色。开封城外，漫天雪花中，两骑前后奔来，当先一匹马上之人，身穿敝裘，双手俱都缩在衣袖中，将马缰系在辔头上，马虽极是神骏，人却十分落魄，头戴一顶破旧的黑皮风帽，紧压着眼帘，瞧也瞧不清他的面目。后面一匹马上，却驮着个死人，尸体早已僵木，只因天寒地冻，是以面容仍然如生，华丽的衣饰，却也仍然色彩鲜艳，完整如新，全身上下，没有一点伤痕，面上犹自凝结着最后一丝微笑，看来平和安适已极，竟似死得舒服得很。 这两骑不知从何而来，所去的方向，却是开封城外一座著名的庄院。此刻马上人极目望去，已可望见那庄院朦胧的屋影。 庄院坐落在冰冻的护城河西，千檐百宇，气象恢宏。高大的门户终年不闭，门前雪地上蹄印纵横，却瞧不见人踪。穿门入院，防风檐下零乱地贴着些告示，有些已被风雪侵蚀，字迹模糊，右面是一重形似门房的小小院落，小院前厅中，绝无陈设，却赫然陈放着十多具崭新的棺木，似是专等死人前来人葬似的。虽然如此严寒，厅中亦未生火。两个黑衣人，以棺木为桌，正在对坐饮酒。 棺旁空坛已有三个，但两人面上仍是绝无酒意。两人身材枯瘦，面容冷削严峻，有如一对石像般，长得几乎一模一样，但彼此却绝不交谈。左面一人右腕已齐肘断去，断臂上配了一只黝黑的巨大铁钩，少说也有十余斤重，瞧他一钩挥下，仿佛要将棺盖打个大洞，哪知铁钩落处，却仅是挑起了一粒小小的花生，连盛着花生的碟子，都未有丝毫震动。右面一人，肢体虽完整，但每喝一杯下去，便要弯腰不住咳嗽，他却仍一杯接着一杯的喝，宁可咳死，也不能不喝酒。 风檐左边过长阶曲廊便是大厅。厅内炉火熊熊，摆着八桌酒筵，每桌酒菜均极丰盛，却只有七个人享用。这七个人还不是同坐一桌，每个人都坐在一桌酒筵的上首，似因谁也不肯陪在下首，是以无人同桌。瞧这七人年龄，最多也不过三十一二，但气派却都不小，神情也都倨傲已极。七人中有男有女，有僧有俗。有人腰悬长剑，有人斜佩革囊，目中神光，都极充足，显见俱都是少年得意的武林高手。七人彼此间又似相识，又似陌生，却绝非来自一处，此刻同时来到这里，谁也不知是为了什么。 穿过大厅，再走曲廊，又是一重院落，院中寂无人声。左面的花厅门窗紧闭，却隐隐有药香透出。过了半晌，一个垂髫童子提着只药罐开门走出，才可瞧见屋里有三个白发苍苍的老人。一人面色枯瘦蜡黄，拥被坐在榻上，似在病榻缠绵已久。另一人长身玉立，气度从容，双眉斜飞入鬓，目光奕奕有神，一双手掌，更是白如莹玉，此刻年华虽已老去，但少年时想他必定是个风神俊朗的美男子。还有一人身材威猛，须发如戟，一双环目，顾盼自雄，奇寒下却仍敞着前胸衣襟，若非须发皆白，哪里像是个老人？ 三个老人围坐在病榻前，榻头矮几上堆着一叠账簿，还有数十根颜色不同，质料也不同的腰带。此刻那环目虬髯的老人，正将腰带一根根拆开，每根腰带中，都有个小小的纸卷。身材颀长的老人，一手提笔，一手展开纸卷，将纸卷上的字句都抄了下来，每张纸卷上的字句都不过只有寥寥三数行而已，谁也不知道上面写的是什么。只见三个老人俱是面色沉重，愁眉不展。 过了盏茶时光，身材颀长的老人方自长叹一声，道：“你我穷数年心血，费数百人之力，所寻访出来的，也不过只有这些了，但愿……”轻咳一声，住口不语，眉宇间忧虑更是沉重。 病老人展颜一笑，道：“如此收获，已不算少。反正你我尽心做去，事总有成功之一日。” 虬髯老人“叭”地一拍手掌，大声道：“大哥说的是，那厮左右也不过只是一个人，难道还会将咱们弟兄吃了不成？” 颀长老人微微一笑，道：“近十年来武林中威名最盛的七大高手，此刻都已在前厅相候。这七人的武功，若真能和他们的盛名相当，七人联手，此事便有成功之望。怕的只是他们少年成名，各不相让，无法同心合力而已。” 这时两骑已至庄前。身穿敞裘、头戴风帽之人翻身落马，抱起那具尸身，走人了庄门。他脚步懒散而缓慢，似是毫无力气，但一手挟着那具尸身，却似毫不费力。他看来落魄而潦倒，但下得马后，便对那两匹骏马毫不照管，似乎那两匹价值千金的骏马纵然跑了，他也不会放在心上。只见他笔直走到防风墙前，懒洋洋地伸手将貂帽向上一推，这才露出了面目，却是个剑眉星目的英俊少年，嘴角微微向上，不笑时也带着三分笑意，神情虽然懒散，但那种对什么事都满不在乎的味道，却说不出的令人喜欢。只有他腰下斜佩的长剑，才令人微觉害怕，但那剑鞘亦是破旧不堪，又令人觉得利剑虽是杀人凶器，只是佩在他身上，便没有什么可害怕的。 风墙上零乱贴着的，竟都是悬赏捉人的告示，每张告示上都写着一人的姓名来历，所犯的恶行，以及悬赏的花红数目。每一人自都是十恶不赦的凶徒。悬赏共有十余张之多，可见近年江湖中凶徒实在不少。下面署名的，却非官家衙门，只是“仁义庄主人”的告示。这“仁义庄主人”竟不惜花费自家的银子为江湖捉拿凶徒，显见实无愧于“仁义”二字。 落魄少年目光一扫，只见最破旧的一张告示上写着：“赖秋煌，三十七岁，技出崆峒，擅使双鞭，囊中七十三口丧门钉，乃武林十九种歹毒暗器之一。此人不但诡计多端，而且淫毒凶恶，劫财采花，无所不为，七年来每月至少做案一次，若有人将之擒获，无论死活，酬银五百两整，绝不食言。仁义庄主人谨启。” 落魄少年伸手撕下了这张告示，转身走向右面小院。他似已来过数次，是以轻车熟路。石像般的两个黑衣人见他前来，对望一眼，长身而起。 落魄少年将尸身放在地上，伸了个懒腰，摊开了手掌，便要拿银子。独臂黑衣人一钩将尸身挑起，瞧了两眼，冷峻的目光中，微微露出一丝暖意，将尸身挟在腋下，大步奔出。另一黑衣人倒了杯酒递过去，落魄少年仰首一饮而尽。从头到尾，三个人谁也没有说话，似是三个哑巴似的。 那独臂黑衣人自小路抄至第二重院落，那颀长老人方自推门而出，见他来了，含笑问道：“又是什么人？” 独臂黑衣人将尸身抛在雪地上，伸出右手食指一指。 颀长老人俯身一看，面现喜色，脱口道：“呀！赖秋煌！” 那虬髯老人闻声奔出，大喜呼道：“三手狼终于被宰了么？当真是老天有眼！是什么人宰了他？” 独臂黑衣人道：“人！” 虬髯老人笑骂道：“俺知道是人！不是人难道还是黄鼠狼不成？你这狗娘养的，难道就不能多说一个字……” 他话未说完，独臂黑衣人突然一钩挥了过来，风声强劲，来势迅急，钩还未到，已有一股寒气逼人眉睫。虬髯老人大惊纵身，一个筋斗翻进去。他身形虽高大，身法却是轻灵巧快无比。但饶是他闪避迅急，前胸衣衫还是被钩破了一条大口子。独臂黑衣人攻出一后，并不追击。虬髯老人怒骂道：“好混球，又动手了，俺若躲得慢些，岂非被你撕成两半。你这狗……” 突听病榻上老人轻叱道：“三弟住口。你又不是不知道冷三的脾气，偏要骂他，岂非找打。” 虬髯老人大笑道：“俺只是跟他闹着玩的。反正他又打不着俺，冷三，你打得着俺，算你有种。” 冷三面容木然，也不理他，笔直走到榻前，道：“五百两。”突然反身一掌，直打那虬髯老人的肩头。他不出钩而用掌，只因掌发无声。 虬髯老人果然被他一掌打得直飞出去，“砰”地撞在墙上，但瞬即翻身站起。那般坚厚的石墙被他撞得几乎裂开，他人却毫无所伤，又自怒骂道：“好混球，真打？”一卷袖子，便待动手。 颀长老人飘身而上，挡在他两人中间，厉声道：“三弟，又犯孩子气了么？” 虬髯老人道：“俺只是问问他……” 颀长老人接口道：“不必问了。你看赖秋煌死时的模样，已该知道杀死他的必定又是那位奇怪的少年。” 病老人道：“谁？” 颀长老人道：“谁也不知他名姓，也无人知他武功深浅。但他这一年来，却连送来七具尸身，七人都是我等悬赏多年，犹未能捉到的恶贼，不但作恶多端，而且凶狠奸诈，武功颇高。谁也不知道这少年是用什么法子将他们杀死的。” 病老人皱眉道：“他既已来过七次，你们还对他一无所知？” 颀长老人道：“他每次到来，说话绝不会超过十个字，问他的姓名，他也不回答，只是笑嘻嘻地摇头。” 虬髯老人失笑道：“这牛脾气倒和冷三有些相似。只是人家至少面上还有笑容，不像冷三的死人面孔。” 冷三目光一凛，虬髯老人大笑着跳开三步，就连那病老人也不禁失笑，半晌又道：“今日你怎知是他？” 颀长老人道：“凡是被他杀死的人，面上都带着种奇诡的笑容。小弟已曾仔细瞧过，也瞧不出他用的是什么手法。” 病老人沉吟半晌，俯首沉思起来。虬髯老人与颀长老人静立一旁，谁也不敢出声打扰。 冷三又伸出手掌，道：“五百两。” 虬髯老人笑道：“银子又不是你拿，你着急什么？” 这两人又在斗口，病老人却仍在沉思，浑如不觉，过了半晌，才自缓缓道：“这少年必然甚有来历。今日之事，不妨请他参与其中，必定甚有帮助……冷三，你去请他至前厅落座用酒……” 冷三道：“五百两。” 病老人失笑道：“这就是冷三的可爱之处，无论要他做什么事，他都要做得一丝不苟；无论你是何人，休想求他通融。只要他说一句话，便是钉子钉在墙上也无那般牢靠，便是我也休想移动分毫……二弟，快取银子给他，但冷三交给那少年银子后，可切莫放他走了。” 冷三接了银子，一个字也不多说，回头就走。虬髯老人笑道：“这样比主人还凶的仆人，倒也少见得很。” 病老人正色道：“以他兄弟之武功，若不是念在他爹爹与为兄两代情谊，岂能屈身此处，三弟你怎能视他为仆？” 虬髯老人道：“俺说着玩的，孙子才视他为仆。” 颀长老人望着病老人微微一笑，道：“若要三弟说话斯文些，只怕比叫冷三开口还困难得多。” 落魄少年与那黑衣人到此刻虽然仍未说话，却已在对坐饮酒，两人你一杯，我一杯。黑衣人酒到杯干，不住咳嗽，落魄少年却比他喝得还要痛快，瞬息间棺材旁空酒坛又多了一个。冷三一手夹着银子，一手钩着尸身，大步走了进来，将银子抛在棺材上，掀起了一具棺材的盖子，铁钩一挥，便将那尸身抛了进去，等到别人看清他动作时，他已坐在地上，喝起酒来。 落魄少年连饮三杯，揣起银子，抱拳一笑，站起就走，哪知冷三身子一闪，竟挡在他面前。落魄少年双眉微皱，似在问他：“为什么？” 冷三终于不得不说话了，道：“庄主请厅上用酒。” 落魄少年道：“不敢。” 冷三一连说了七个字，便已觉话说得太多，再也不肯开口，只是挡在少年身前，少年向左跨一步，他便向左挡一步，少年向右跨一步，他便向右挡一步。 落魄少年微微一笑，身子不知怎么一闪，已到了冷三身后，等到冷三旋身追去，那少年已到了风墙下，向冷三含笑挥手。冷三知道再也追他不着，突然抡起铁钩，向自己头顶直击而下。落魄少年大惊掠去，人还未到，一股掌力先已发出，冷三只觉铁钩一偏，还是将左肩划破一道创口，几乎深及白骨。 落魄少年又惊又奇，道：“你这是做什么？” 冷三创口鲜血顺着肩头流下，但面色却丝毫不变，更未皱一皱眉头，只是冷冷说道：“你走，我死。” 落魄少年呆了一呆，摇头一叹，道：“我不走，你不死。” 冷三道：“随我来。”转身而行，将少年带到大厅，又道：“坐。”瞧也不瞧大厅中人一眼，掉头就走。 落魄少年目送他身形消失，无可奈何地苦笑一声，随意选了张桌子，在下首坐了下来。只见上首坐着一个三十左右的僧人，身穿青布僧袍，相貌威严，不苟言笑，挺着胸膛而坐，双手垂放膝上，似是始终未曾动箸，目光虽然笔直望着前方，有人在他对面坐下他却有如未曾瞧见一般。落魄少年向他一笑，见他毫不理睬，也就罢了，提起酒壶，斟满一杯，便待自家饮酒。 青衣僧人突然沉声道：“要喝酒的莫坐在此张桌上。” 落魄少年一怔，但面上瞬即泛起笑容，道：“是。”放下酒杯，转到另一张桌边坐下。 这一桌上首，坐的却是个珠冠华服的美少年，不等落魄少年落座，先自冷冷道：“在下也不喜看人饮酒。” 落魄少年道：“哦。”不再多话，走到第三桌，上首坐着个衣白如雪的绝美女子，瞧见少年过来，也不说话，只是冷冷地瞄着他，皱了皱眉头。落魄少年赶紧走了开去，走到第四桌，一个瘦骨嶙峋的乌簪道人突然站了起来，在面前每样菜里，个个吐了口痰，又自神色不动地坐了下去。落魄少年瞧着他微微一笑，直到第五桌，只见一个又肥又丑，腮旁长着个肉瘤，满头杂草般黄发的女子，正在旁若无人，据案大嚼，一桌菜几乎已被她吃了十之八九。 这次却是落魄少年暗中一皱眉头，方自犹豫间，突听旁边一张桌上有人笑道：“好酒的朋友，请坐在此处。” 落魄少年转目望去，只见一个鹑衣百结，满面麻子的独眼乞丐，正在向他含笑而望。隔着张桌子，已可嗅到这乞丐身上的酸臭之气，落魄少年却毫不迟疑，走过去坐下，含笑道：“多谢。” 眇目乞丐笑道：“我本想和阁下痛饮一杯，只可惜这壶里没有酒了。只有以菜作酒，聊表敬意。” 举起筷子，在满口黄牙的嘴里啜了啜，夹了块蹄膀肥肉，送到少年碟子里。落魄少年看也不看，连皮带肉，一齐吃了下去。看来莫说这块肉是人挟来的，便是自狗嘴吐出，他也照样吃得下去。 旁边第七张桌上，一个紫面大汉，瞧着这少年对什么都不在乎的模样，不禁大感兴趣，连手中酒都忘记喝了。 突见一个青衣童子手捧酒壶奔了过来，奔到乞丐桌前，笑道：“酒来迟了，两位请恕罪。”将两人酒杯俱都加满。 落魄少年含笑道：“多谢！”随手取出一百两一封的银子，塞在童子手里。 青衣童子怔了怔，道：“这……这是什么？” 落魄少年笑道：“这银子送给小哥买鞋穿。” 青衣童子望着手里的银子，发了半晌呆，道：“但……但……”突然转身跑开。他见过的豪阔之人虽然不少，但出手如此大方的却从未见过。 眇目乞丐举杯道：“好慷慨的朋友，在下敬你一杯。”两人举杯，一饮而尽。眇目乞丐忽然压低语声，道：“在下近日也有些急用，不知朋友你……” 落魄少年不等到他话说完，便已取出四封银子，在桌上推了过去，笑道：“区区之数，老兄莫要客气。” 这五百两银子他赚得极辛苦，但花得却容易已极，当真是左手来，右手去，连眉头都未曾皱一皱。 眇目乞丐将银子藏起，叹了口气，道：“在下之急用，本需六百两银子，朋友却恁地小气，只给四百两。” 落魄少年微微一笑，将身上敞裘脱了下来，道：“这皮裘虽然破旧，也还值二百两银子，老兄也拿去吧。” 眇目乞丐接过皮裘，在毛上吹了口气，道：“嗯，毛还不错，可惜太旧了些……”翻来覆去，看了几眼，又道：“最多只能当一百五十两，还得先扣去十五两的利息，唉……唉，也只好将就了。” 别人与他素昧平生，如此对待于他，他还似觉得委屈得很，半句也不称谢。 落魄少年全不在意，身上已只剩一件单衣，也不觉冷，只是含笑饮酒。 旁边那紫面大汉却突然一拍桌子，大骂道：“好个无耻之徒，若非在这仁义庄中，乔某必定要教训教训你。” 眇目乞丐横目道：“臭小子，你在骂谁？” 紫面大汉推杯而起，怒喝道：“骂你，你要怎样？” 眇目乞丐本是满面凶狠之态，但见到别人比他更狠，竟然笑了笑道：“原来是骂我，骂得好……骂得好……” 落魄少年也不禁瞧得呆住了，又不觉好笑。 紫面大汉走过来一拍他的肩头，指着眇目乞丐鼻子道：“兄弟，此人欺善怕恶，随时随地都想占人便宜。你无缘无故给他银子，他还说你小气，这种人岂非畜生不如！” 眇目乞丐只当没有听到，举起酒杯，喝了一口，叹道：“好酒，好酒！不花钱的酒不多喝两杯，岂非呆子。” 紫面大汉怒目瞪了他一眼。那长着肉瘤的丑女隔着桌子笑道：“乔五哥，此人虽可恶，但你也将他骂得怪可怜的，饶了他吧。” 她人虽长得丑怪，声音却柔和无比，教人听来舒服得很。 紫面大汉乔五冷哼一声道：“瞧在花四姑面上……哼，罢了。”悻悻然回到座上，重重坐了下去。 花四姑笑道：“乔五哥真是急公好义，瞧见别人受了欺负，竟比被欺负的人还要生气……” 乌簪道人冷冷截口道：“皇帝不气气死太监，这又何苦！” 落魄少年眼见这几人脾气俱是古里古怪，心里不禁暗觉有趣，面上却仍是带着笑容，也不说话。突听一阵朗笑之声，自背后传了出来，道：“有劳各位久候，恕罪恕罪。”那颀长老人随着笑声，大步而入。 眇目乞丐当先站了起来，笑道：“若是等别人，那可不行，但是等前辈，在下等上一年半载也没关系。” 颀长老人笑道：“金大侠忒谦了。”目光一转，道：“今日之会，能得五台山天龙寺天法大师、青城玄都观断虹道长、‘华山玉女’柳玉茹姑娘、‘玉面瑶琴神剑手’徐若愚徐大侠、长白山‘雄狮’乔五侠、‘巧手兰心女诸葛’花四姑、丐帮‘见义勇为’金不换金大侠七位俱都前来，在下实是不胜欣喜，何况还有这位……”目光注定那落魄少年，笑道：“这位少年英雄，大名可否见告？” 乌簪道人断虹子冷冷道：“无名之辈，也配与我等相提并论。” 落魄少年笑道：“不错，在下本是无名之辈。” 颀长老人含笑道：“阁下如不愿说出大名，老朽也不敢相强。但阁下之武功，老朽却当真佩服得很。” 众人听这名满天下的武林名家竟然如此夸奖这少年的武功，这才都去瞧了他一眼，但目光中仍是带着怀疑不信之色。落魄少年面上虽无得意之色，但处在这当今武林最负盛名的七大高手之间，也无丝毫自惭形秽之态，只是淡淡一笑，又紧紧闭起了嘴巴。 “华山玉女”柳玉茹忽然道：“前辈召唤咱们前来，不知有何见教？” 只见她一身白衣如雪，粉颈上围着条雪白的狐裘，衬得她面靥更是娇美如花，令人不饮自醉。 颀长老人道：“柳姑娘问得好，老朽此番相请各位前来，确是有件大事，要求各位赐一援手。” 柳玉茹姑娘眼波流动，神采飞扬，娇笑道：“求字咱们可不敢当。有什么事，李老前辈只管吩咐就是。” 颀长老人道：“此事始末。各位或许早已知道，但老朽为了要使各位更明白些，不得不从头再说一遍……”语声微顿道：“古老相传，武林中每隔十三年，便必定大乱一次。九年之前，正是武林大乱之期，仅仅三四个月间，江湖中新起的门派便有十六家之多，每个月平均有九十四次知名人士的决斗，一百八十多次流血争杀，每次平均有十一人丧命，未成名者远不在此数……” 他长长叹了口气又道：“其时武林之混乱情况，由此可见一斑。但到了那年入冬时，情况更比以前乱了十倍。” 这老人似因忆及昔日那种恐怖情况，明朗的目光中，已露出惨淡之色，黯然出神了半晌，方接道：“只因那年中秋过后，武林中突然传开件惊人的消息，说是百年前‘无敌和尚’仗以威震天下的‘无敌宝鉴，七十二种内外功秘笈’，乃是藏在衡山回雁峰巅。”他自取杯浅啜，接道：“这消息不知从何传出，但因那‘无敌宝鉴’，实是太过动人，是以武林群豪，宁可信其有，不愿信其无，谁也不肯放过这万一的机会，闻讯之后，便将手头任何事都暂且抛开，立刻赶去衡山。闻得江湖传言，衡山道上，每天跑死的马，至少有百余匹之多。武林豪强行走在道上，只要听得有人去衡山便立刻拔剑，只因去衡山的少了一人，便少了个抢夺那‘无敌宝鉴’的敌手。最可叹的是，有些去衡山拜佛的旅人，也无辜遭了毒手。” 他说到这里，“雄狮”乔五、“女诸葛”花四姑等人，面上也已露出黯然之色，断虹子、金不换却仍毫不动容。 颀长老人沉痛地长叹一声，道：“那时正是十一月底，天上已开始飘雪，武林群豪为了抢先一步赶到衡山，纵然在道上见到至亲好友的尸身，也无人下马埋葬，任凭那尸身掩没在雪花中。事后老朽才知道，还未到衡山便已死在路上的武林高手，竟已有一百八十余人之多，其中有三人，已是一派宗主的身份。这情况却又造成了一个人的侠名，此人竟肯牺牲那般宝贵的时间，将路尸一一埋葬。” 徐若愚插口道：“此人可是昔日人称‘万家生佛’的柴玉关？” 颀长老人道：“不错……徐少侠见闻端的渊博。” 徐若愚面上微露得色，道：“在下曾听家师言及，说这柴大侠行事正直，常存侠心，武林人士无不敬仰，只可惜也在衡山一役中不幸罹难，而且死得甚是悲惨，面目俱被那世上最最歹毒的暗器‘天云五花绵’所伤，以致面目溃烂，头大如斗……唉！当真是苍天不佑善人，好教吾等后生晚辈扼腕。”别人说他见闻渊博，他更是滔滔不绝，将所知之事俱都说出，只道那颀长老人必定又要夸赞他几句，是以口中虽在叹息扼腕，脸上却是满面得色。 哪知颀长老人此刻却默然无语，面上神色，也不知是愁是怒，过了半晌，缓缓道：“那时稍有见识之武林豪土，已知单凭一人之力，是万万无法自如此局面中夺得真经宝鉴的，于是便在私下聚集同道，组成联盟之势。那些阴险狡诈之人，更是从中挑拨离间，无所不为。有些淡泊名利之人，本无心于此，却也被同门师弟，或是同道好友以情分打动，请来助拳，而不得不卷入这漩涡之中。”他顿了一顿，又道：“只因一些凶狡之徒，一心想夺得真经，肆虐天下；侠义之士，更是怕真经被恶徒夺去，江湖便要从此不安。各人夺取真经的目的，虽然大有不同，但人人都想将真经据为已有，也是不容否认的事。三日之间，衡山回雁峰竟聚集了将近两百位武林英豪，而且都是不可一世的绝顶高手，武功稍微差些的，不是未至回雁峰便已死去，就是半途知难而退了。” 这老人不但将此事说得十分简要，而且言语有力，动人心魄。只听他接道：“这班武林高手，来自四面八方，其中不但包括了武林七大门派的掌门人，就连一些早已洗手的魔头，或是久已归隐的名侠亦在其中。两百人结成了二十七个集团，展开了连续十九天的恶战。”他黯然长叹，接道：“在那十九天里，衡山回雁峰上，当真是剑气凌霄，飞鸟绝迹，无论是谁，无论有多么高明的武功，只要置身在回雁峰上，便休想有片刻安宁。只因那里四处俱是强敌，四面俱有危机，每个人的性命，俱都悬于生死一线之间，自‘中州剑客’吃饭时被人暗算，‘万胜刀’徐老镖头睡觉时失去头颅后，更是人人提心吊胆，连吃饭睡觉都变成了极为冒险的事……这连日的生死搏杀，再加上心情之紧张，竟使得每个人神智都失了常态，平日谦恭有礼的君子，此时也变成了谁都不理的狂徒，‘衡山派’掌门人玉玄子，五日未饮未食，手创第六个对手后，首先疯狂，竟将他平生唯一的知己朋友‘石棋道人’一剑杀死，自己也跳下万丈绝壑，尸首无存。” 突听“当”的一响，竟是花四姑听得手掌颤抖，将掌中酒杯跌落到地上众人也听得惊心动魄，耸然变色。 颀长老人缓缓合起眼帘，缓缓接道：“这十九日恶战之后，回雁峰上两百高手竟只剩下了十一人，而这十一人亦是身受内伤，武功再也不能恢复昔日的功力，武林中精华，竟俱都丧生在这一役之中。五百年来，江湖中大小争杀，若论杀伐之惨，伤亡之众，亦以此役为最。”说到这里，他紧闭的双目中似已沁出两粒泪珠，原来这老人昔年人称“不败之剑”李长青，与那病老人“天机地灵，人中之杰”齐智，虬髯老人“气吞斗牛”连天云，结义兄弟三人，俱是衡山一役之生还者，昔日那惨烈的景象，他三人至今每一思及，犹不免为之潸然泪下。 大厅中静寂良久，李长青缓缓道：“最令人痛心疾首的，便是此事根本不过只是欺人之骗局。我与齐智齐大哥、连天云连三弟、少林弘法大师、武当天玄遣长，以及那一代大侠‘九州王’沈天君，最后终于到了回雁峰巅藏宝之处，那时我六人俱已是强弩之末，合六人之力，方将那秘洞前之大石移开，哪知洞中却空无一物，只有洞壁上以朱漆写着五个大字：‘各位上当了’……” 虽已事隔多年，但他说到这五个字时，语声仍不禁为之颤抖，仰天吐出口长气，方自接道：“我六人见着这壁上字迹，除了齐大哥外，俱都被气得当场晕厥，醒来时，才发觉沈大侠与少林弘法大师，竟已……竟已死在洞里……原来这两位大侠悲天悯人，想到死在这一役中的武林同道，自责自愧悲愤交集，竟活生生撞壁而死。武当天玄道长伤势最重，勉强挣扎着回到观中，便自不治。只有我兄弟三人……我兄弟三人……一直偷生，活到今日……”语声哽咽，再也说不下去。 众人听得江湖传闻，虽然早已知道此事结果，但此刻仍是怦然动心，甚至连那落魄少年，也黯然垂下头去。 “雄狮”乔五突然拍案道：“生死无常，却有轻重之分。李老前辈之生，虽说重于泰山，焉能与偷生之辈相比！李老前辈如若也丧生在衡山一役之中哪有今日之‘仁义庄’来为江湖主持公道！” 李长青黯然叹道：“衡山一战中，黑白两道人士，虽然各有伤损，但二派高手之中的白道英侠，十九丧生；黑道朋友大多心计深沉，见机不对便知难而退，是以死得较少。正消邪长，武林局势若是自此而变，我等岂非罪孽深重！是以我齐大哥才想出这以悬赏花红，制裁恶人之法，只因此举不但可鼓励一些少年英雄，振臂而起，亦可令黑道中人，为了贪得花红，而互相残杀。 花四姑叹道：“齐老前辈果然不愧为武林第一智者。” 李长青道：“怎奈此举所需资金太大，我弟兄虽然募化八方，江湖中十八家大豪也俱都慷慨解囊，数目仍是有限，这其间便亏了‘九州王’沈大侠之后人，竟令人将沈大侠之全部家财，全部送来。沈大侠簪缨世家，资财何止千万，此举之慷慨，当真可说得上是冠绝古今。” “雄狮”乔五击节叹道：“沈大侠名满天下，想不到他的后人亦是如此慷慨！此人在哪里？乔某真想交他一交。” 李长青叹道：“我兄弟也曾向那将钱财送来之人再三询问沈家公子的下落，好去当面谢过，但那人却说沈公子散尽家财之后，便孤身一人，浪迹天涯去了。最可敬的是，当时那位沈公子，只不过是个十岁左右的髫龄幼童，却已有如此胸襟，如此气魄，岂不令人可敬可佩。” “华山玉女”柳玉茹幽幽长叹一声，道：“女子若能嫁给这样的少年，也算不负一生了……” “玉面瑶琴神剑手”徐若愚冷冷道：“世上侠义慷慨的英雄少年，也未必只有那沈公子一个。” 柳玉茹冷冷瞧他一眼，道：“你也算一个么？” 落魄少年含笑接口道：“徐兄自然可算一个的。” 徐若愚怒道：“你也配与我称兄道弟？” 落魄少年笑道：“不配不配，恕罪恕罪……” 柳玉茹看了落魄少年一眼，不屑地冷笑道：“好个没用的男人，当真丢尽男人的脸了。”语声中充满轻蔑之意。 落魄少年却只当没有听到。“雄狮”乔五双眉怒轩，似乎又待仗义而言，花四姑瞧着那落魄少年，目光中却满是赞赏之意。 李长青不再等别人说话，也咳一声，道：“我弟兄执掌‘仁义庄’至今已有九年。这九年，遭遇外敌，不下百次。我兄弟武功十成中已失九成，若非我等那忠仆义友，冷家兄弟拼命退敌，‘仁义庄’只怕早已烟消云散。而‘仁义庄’发出之花红赏银，至今虽然已有十余万两，但昔年之母金，却至今未曾动用，这又全都亏冷二弟经营有方，他一年四季，在外经营奔走，赚来的利息， 已够开支。这兄弟三人义薄云天，既不求名，亦不求利，但‘仁义庄’能有今日之名声，却全属他兄弟三人之力，我弟兄三人却只不过是掠人之美，徒得虚名罢了，说来当真惭愧得很。” 柳玉茹嫣然笑道：“李老前辈自谦了……你老人家今日令晚辈前来，不知究竟有何吩咐？” 李长青沉声道：“衡山宝藏，虽是骗局，但衡山会后，却的确遗下了一宗惊人的财富。” 金不换张大了眼睛，道：“什么财富？” 李长青道：“上得回雁峰之两百高手，人人俱是成名多年之辈，武功俱有专长。这些人自知上山后难有生还之望，惟恐自家武功，从此失传，都要将自身的武功秘笈和一些遗物交托下来，而这些人有的并无传人，有的传人已死在此役中，纵有传人，也不在身边，是以到底要将遗物交托给谁，便成了一件很难决定之事，最后只有将遗物埋藏在隐秘之处，自己若不能活着来取，也好留待有缘……这时那‘万家生佛’柴玉关正是声誉鹊起，江湖中人人都赞他乃是英雄手段，菩萨心肠，而柴玉关平日就轻财好友，武林中成名英雄，大半与他有交，是以每人埋藏遗物时，谁也没有避他，有些人甚至还特地将藏物之处告诉了他，自己若是亡故，便托他将遗物安排。” 李长青长叹一声，接道：“衡山会后，活着的十一人中，倒有七人俱是将遗物交托给柴玉关的，但他们既然还活着，自然便要将遗物取回，哪知到了藏物之处，他们所藏的秘籍与珍宝，竞都踪影不见，在那藏物之地，却多了张小小的纸柬，上面写的赫然竟也是各位上当了。” 这衡山会后的余波，实是众人从未听过的，大家都听得心头一震，徐若愚道：“但……柴前辈却已中毒而死……” 李长青道：“谁也没有瞧见柴玉关是否真的死了，又怎知他不是将自己衣衫换在别人的尸身上？何况，我齐大哥研究字迹，那洞中‘各位上当了’五个字，笔迹完全与柴玉关一样，再仔细一想，那‘回雁峰藏有无敌宝鉴’的消息，十人中也有五六人是自柴玉关口中听来的。这些武林高手俱都对柴玉关十分信任，不觉再传说了出去，而别人却对这些武林高手十分信任，这消息才会越传越广，越传越真实了。”他面上渐渐露出怨恨之色：“他处心积虑，如此做法，不但可将武林高手一网打尽，让他一人称雄，还可令当时在武林扬名的武功，大半从此绝传，教武林永远不能恢复元气，他自身得了这许多人遗下之武功秘籍，自可身兼各宗之长，那时他纵横天下，还有谁能阻挡？这些年他始终未曾现身，想必已将各门派的武功奥秘，全都研习了一番，此时此刻，便是他再出山之日了。” 众人但觉心头一寒，谁也不敢多口说话。 寂然良久，那五台天法大师方自缓缓道：“若果真如此，此人当真可说是千百年来，江湖中第一个大奸大恶之人。但这些事虽然证据确凿，终究不能完全确定这些事俱是柴某所为。不知李老前辈以为然否？”语声缓慢，声如洪钟，分析事理，更是公平正大，端的不愧为自少林弘法大师仙去后，当世武林之第一高僧，声誉早已凌驾少林当今掌门刃心大师之上。 李长青叹道：“大师说得好，大师说得好！这也正是我等相请各位前来的原因……三年后我等突然发现，玉门关内外，出现了一位奇人，此人不但行踪飘忽，善恶不定，最令人注意的，乃是此人身怀各门派武功之精萃，每一出手，俱是不同门派的招式。曾有人亲眼见他使出武当、少林、峨嵋、崆峒、昆仑五大门派之不传秘学，而那些招式连五大门派之掌门人都未学过。” 众人面面相觑，耸然动容。 李长青接道：“还有，此人举止之豪阔奢侈，也是天下无双。每一出行，随从常在百人之上，一日所费，便是万两白银。从无人知道他的姓名来历，亦无人知道他落足之处，只知他本在边疆，招集恶徒以为羽党，而今势力已渐渐扩张，渐渐侵至中原一带，竟似有独霸天下之势。” 徐若愚脱口道：“此人莫非便是柴玉关不成？” 李长青叹道：“此人一出，我齐大哥便已疑心他是柴玉关，立刻令人探听此人之行踪，一面又令人远至四面八方，搜寻有关柴玉关之平生资料。我等三人对柴玉关之历史所知越多，便越觉得此人可疑可怕。” 天法大师沉吟道：“不错，天下英雄虽都知‘万家生佛’柴玉关之侠名，但他成名前之历史，却是无人知道。” 徐若愚接道：“莫非他成名前还有什么隐秘不成？” 李长青沉声道：“我弟兄三人耗资五十万，动员千人以上，终于将他之身世寻出一个轮廓，方才已将所有资料抄录下一份，各位不妨先看看再作商量。”将手中纸卷展开挂在墙上，目光却凝注着门窗，显然在提防外人闯入。此时又有个垂髫童子送来八份纸笔，天法大师等每人都取了一份。 只见那纸卷共有两幅，宽仅丈余，宛如富贵人家厅前所悬之横匾般模样，上面密密地写满了字，左面一幅纸卷写的是： 姓名：二十岁前名柴亮，二十至二十六岁名柴英明，二十六至三十七名柴立，三十七后名柴玉关。 来历：父名柴一平，乃鄂中巨富；母名李小翠，乃柴一平之第七妾。兄弟共有十六人，柴玉关排行第十六，幼时天资聪明，学人说话，惟妙惟肖，是以精通各省方言，成名后自称中州人士，天下人莫不深信不疑。柴玉关十四岁时，家人三十余口在一夕中竟悉数暴毙。柴玉关接管万贯家财后，便终日与江湖下五门之淫贼“鸳鸯蝴蝶派”厮混，三年后便无余财，柴玉关出家为僧。 门派：十七岁投入少林门下为火工僧人，后因偷学武功被逐。二十岁人“十二连环坞”以能言善道得帮主“天南一剑”史松寿赏识，收为门下，传艺六年后，柴玉关竟与“天南一剑”之宠妾金燕私通，席卷史松寿平生积财而逃，史松寿大怒之下，发动全帮弟子搜其下落。柴玉关被逼无处容身，竟远赴关外，将金燕送给了江湖中人称“色魔”的“七心翁”，以作进身之阶，十年间果然将“七心派”武功使得炉火纯青。那时“七心翁”竟又暴毙而亡，柴玉关再人中原，便以仗义疏财之英侠面目出现，首先联合两河英豪，扫平“十二连环坞”，重创“天南一剑”，遂名震天下。 外貌：此人面如白玉，眉梢眼角微微下垂，鼻如鹰钩，嘴唇肥厚多欲，嘴角两边，各有黑痣一点，眉心间有一肉球，雅好修饰，喜着精工剪裁之贴身衣衫，以能显示身材之修长，尤喜紫色。双手纤莹，白如妇人女子，中指御紫金指环，是以说话时每喜夸张手势，以夸耀双手之整洁雅美。 嗜好：酒量极豪，喜欢以大曲、茅台、高梁及竹叶青掺合之烈酒，配以烤至半熟之蜗牛、牡蛎，或蛇肉佐食；不喜猪肉，从不进口。骑术极精，常策马狂奔，以至鞭马而死。喜豪赌，赌上从无弊端，以求刺激。喜狩猎，尤喜美女，色欲高亢，每夕非两女不欢。 特点：此人口才便捷，善体人意，成名英豪，莫不愿与之相交。说话时常带笑容，杀人后必将双手洗得干干净净，所用兵刃上要一染血污，便立刻废弃，长书画，书法宗二王，颇得神似。 这幅纸卷简单而扼要地叙出了柴玉关之一生。他一生当真是多姿多彩，充满了邪恶的魅力。众人只瞧得惊心动魄，面目变色。再看右面纸卷，写的是： 姓名：玉门关外人称“快活王”，真名不详。 来历：不详。 门派：不详，却通天下各门派不传之绝技。 外貌：面目，眉目下垂，留长髯，鼻如鹰钩，眉心有伤疤，喜修饰，有专人每日为其修洗须发。体修长，衣衫考究，极尽奢华。说话时喜以手捋须，须及手均极美。左手中指御三枚紫金指环，似可作暗器之用。 嗜好：酒量极好，喜食异味，不进猪肉，身边常有绝色美女数人陪伴，常与巨富豪客作一掷千金之豪赌。 特点：能言喜笑，慷慨好客，每日所费，常在万金之上。极端好洁，座客如有人稍露污垢，立被赶出。随行急风三十六骑，俱是外貌英俊，骑术精绝之少年，使长剑，剑招却仅有十三式，但招式奇诡辛辣，纵是武林成名高手，亦少有人能逃出这十三式。 另有酒、色、财、气四大使者乃“快活王”最信任之下属，却极少在其身边，只因这四人各有极为特别之任务。酒之使者为其搜寻美酒，色之使者为其各处征选绝色，财之使者为其管理并搜集钱财，唯有气之使者跟随在他身边极少离开，当有人敢对“快活王”无礼，气之使者立刻拔剑取下此人首级。这四人俱是性情古怪，武功深不可测。 众人瞧完了这幅纸卷，更是目定口呆，作声不得。 直到众人俱已看完，且已将要点记下，李长青方自沉声道：“各位可瞧出这两人是否有许多相同之处？” 徐若愚抢先道：“这两人最少有十三点相同之处：面白，眉垂，鼻钩，体长，手美，衣华，好酒，好色，好赌，嗜食异味，不进猪肉，手上喜御指环，说话喜作手势……捋须也算手势，是么？” 他一口气说出十三点相同之处，面上不禁又自露出得色，哪知“华山玉女”柳玉茹却冷冷道：“还有两点，你未瞧出。” 徐若愚皱眉道：“哪两点？” 柳玉茹道：“柴玉关嘴厚有痣，快活王却留有长髯；柴玉关眉心有肉球，快活王眉心有道刀疤，这两点看来最不明显，其实却最当注意。还有两人俱都能言喜笑，乐于交友，实是太容易看出来了，我真不屑说出。” 徐若愚面颊一红，道：“哦？……是么？”转过头去，端起酒杯，仰起脖子倒下喉咙，再也不去瞧柳玉茹一眼。 李长青道：“徐少侠说的不错，柳姑娘瞧得更加的仔细。但是除了这些之外，还有许多更需注意之处。” 柳玉茹也不禁脸一红，道：“哦？……是么？” 李长青道：“各位看凡与柴玉关亲近之人，多有一夕暴毙之事，甚至亲如父子兄弟，亦不例外，想来他们暴毙原因，必与柴某有关。由此可见此人之凶狡无情。柴玉关自衡山一役中，所得武功秘籍与珍宝无数，‘快活王’正是多财而遍知天下各派的武功，柴玉关既能毒毙亲人，背叛师门，甚至连床头人都可自别人身边夺来，转手便毫不吝惜地送给别人，出卖朋友，更算不得一回事了。”他语气越说越愤怒，双目灼灼发光，厉声接道：“综据各点，委实已可判断，柴玉关与那‘快活王’实是一人。” 众人思前忖后，再无异议，就连天法大师，亦是微微颔首，合十长叹道：“此人多欲好奢，来日必将自焚其身。” 李长青道：“大师说得不错，此人正是因为欲望太多，性喜奢侈，方自做得出这些令人发指事来。但我等若是等他自焚其身便已太迟了，到那时，又不知有多少人要死在他手上。” 天法大师合十颔首，长叹不语。 李长青缓缓接道：“我兄弟今日相请各位前来，便是想请各位同心协力，揭破此人之真相。此人虽是阴猾凶恶，但各位亦是今日江湖中一时之选，合各位之力，实不难为武林除此心腹大患。”他说完了话，大厅中立时一片寂然，人人面色俱是十分沉重，有的垂首深思，有的仰面出神，有的只是皱眉不语。 过了半晌，金不换突然道：“咱们若真将那‘快活王’杀了，他遗下的珍宝，却不知应该如何发落？” 李长青瞧了他一眼，微微含笑道：“他所遗下之珍宝，大都是无主之物，自当奉赠各位，以作酬谢。” 金不换道：“除此之外，便没有了么？” 李长青道：“除此之外，敝庄还备有十万花红。” 金不换嘻嘻一笑，抚掌道：“如此说来，这倒可研究研究。”取杯一饮而尽，夹了块肉开怀大嚼。 雄狮乔五冷哼了一声，道：“果然是见财眼开，名不虚传，只怕躺到棺材里还要伸出手来。” 金不换咯咯笑道：“过奖过奖，好说好说。” “玉面瑶琴神剑手”一直仰天出神，别人说话他根本未曾听进，此刻方缓缓道：“此事虽然困难，倒真是扬名天下的良机……”突然一拍桌子，道：“对了，谁若能杀了那‘快活王’，就该赠他武功第一的名头才是。” 柳玉茹冷冷道：“纵然如此，那武功天下第一的名头，只怕也未必能轮到你这位神剑手。” 徐若愚冷笑道：“是么？……嘿嘿！”又自出起神来。 大厅中又复寂然半晌，青城玄都观主断虹子突然仰天笑道：“哈哈……可笑可笑，当真可笑。”他口中虽在放声大笑，但面容仍是冰冰冷冷，笑声更是冷漠无情，看来哪有半分笑意。 李长青道：“不知道长有何可笑之处？” 断虹子道：“阁下可是要这些人同心协力？” 李长青道：“不错。” 断虹子冷笑道：“阁下请瞧瞧这些英雄好汉，不是一心求名，便是一心贪利，可曾有一人为别人打算？若要这些人同心协力，嘿嘿！比缘木而求鱼还要困难得多。” 李长青皱眉而叹，良久无语。 “巧手兰心女诸葛”花四姑微笑道：“断虹道长此话虽也说得有理，但若说此地无人为别人打算，却也未必见得，不说别人，就说咱们乔五哥，平生急公好义，几曾为自己打算过？” 断虹子道：“哼，哼哼。”两眼一翻，只是冷笑。 花四姑接道：“何况……纵使人人俱都为着自己，但是只要利害关系相同，也未尝不能同心协力。” 李长青叹道：“花四姑卓见确是不凡……” 突见五台天法大师振衣而起，厉声道：“柴玉关此人，确是人人得而诛之，贫僧亦是义不容辞。但若要贫僧与某些人协力同心，却是万万不能。告辞了。”大袖一拂，便待离座而去。 忽然间，只听一阵急骤的马蹄声，随风传来，到了庄院前，也未停顿，人马竟似已笔直闯入庄来。天法大师情不自禁，顿住身形，众人亦是微微变色，一齐展动身形。厅上一阵轻微的衣袂带风声过后，九个人已同时掠到大厅门窗前，轻功身法，虽有高下之分，但相差极是有限。 李长青纵是武功已失十之七八，身法亦不落后，抢先一步，推开门户；沉声道：“何方高人，降临敝庄？” 语声未了，已有八匹健马，一阵风似的闯入了厅前院落，八匹高头大马，俱是铁青颜色，在寒风中人立长嘶，显得极是神骏，马上人黑衣劲装，头戴范阳毡笠，腰系织锦武士巾，外罩青花一口钟风氅，腿打倒赶千层浪裹腿，脚登黑缎搬尖洒鞋，浓黑的眉毛，配着赤红的面膛，虽然满身冰雪，但仍是雄赳赳，气昂昂，绝无半分畏缩之态。 厅中九人是何等目光，一眼望去，就知道这八人自身武功，纵未达到一流高手之境，但来历亦必不凡。 李长青还未答话，急风响过，冷三已横身挡在马前。他身躯虽不高大，但以一身横挡着八匹健马，直似全然未将这一群壮汉骏马放在眼里，冷冷道：“不下马，就滚！”词色冰冷，语气尖锐，对方若未被他骇倒，便该被他激怒，哪知八条大汉端坐在马上，却是动也不动，面上既无惊色，亦无怒容，活生生八条大汉，此刻亦似八座泥塑金刚一般。冷三居然也不惊异，面上仍是冰冰冷冷，口中不再说话，左臂突然抡起，一钩挥出钩住了马腿。那匹马纵是千里良驹，又怎禁得住这一钩之力，惊嘶一声，斜斜倒下。冷三跟着一腿飞出，看来明明踢不着马上骑士，但不知怎的，却偏偏被他踢着了，马倒地，马上人却被踢得飞了出去。变生突然；冷三动作之快，端的快如闪电。 但另七匹人马，却仍然动也不动，直似未闻未见。马上人不动倒也罢了，连七匹马都不动弹；竟是令人惊诧，若非受过严格已极之训练，焉能如此？ 群豪都不禁耸然为之动容。冷三击倒了第一匹人马，却再也不瞧一眼，身形展动又向第二匹马掠去。他全身直似有如机械一般，绝无丝毫情感，只要做一件事，便定要做到底，外来无论任何变化，变化无论如何令人惊异，也休想改变他的主意。 突听李长青沉声叱道：“且慢！” 冷三一钩已挥出，硬生生顿住，退后三尺，李长青身形已到了他前面，沉声道：“朋友们是何来历？到敝庄有何贵干？” 金不换冷冷接口道：“到了仁义庄也敢直闯而人，坐不下马，朋友们究竟是仗着谁的势力，敢如此大胆？” 七条大汉还是不答话，门外却已有了语声传了进来，一字字缓缓道：“我爱怎样就怎样！谁也管不着！”语气当真狂妄已极，但语声却是娇滴清脆，宛如黄莺出谷。 金不换眯起眼睛道：“乖乖，妙极，是个女娃娃。”转首向徐若愚一笑：“徐兄你的机会来了。” 徐若愚板着脸道：“休得取笑。”口中虽如此说话，双手却情不自禁，正了正帽子，整了整衣衫，作出潇洒之态，歪起了脸，眉毛一高一低，斜着眼望去。只见一辆华丽得只有书上才能见到的马车，被四匹白马拉了进来，两条黑衣大汉驾车，两条锦衣大汉跨着车辕。 李长青微微皱眉，眼见那马车竟笔直地驶到大厅阶前，终于忍不住道：“如此做法，不嫌太张狂了么？” 车中人冷冷道：“你管不着！” 李长青纵是涵养功深，此刻面上也不禁现出怒容，沉声道：“姑娘可知道谁是此庄主人？” 哪知车中人怒气比他更大，大声道：“开门开门……我下去和他说话，” 两条跨着车辕的锦衣大汉，自车座下拖出柄碧玉为竿，细麻编成的扫帚，首先跃下，将车门前扫得干干净净。接着，两个容色照人的垂髫小鬟，捧着卷红毡，自车厢里出来，俯下身子，展开红毡。 金不换双手抱在胸前，一副要瞧热闹的模样。徐若愚眼睛睁得更大。 柳玉茹面上虽满是不屑之色，心里也不觉暗暗称奇：“这女子好大的气派，又敢对仁义庄主人如此无礼，却不知是何人物？……长得如何模样？”别的犹在其次，这女子长得漂不漂亮，才是她最关心的事，也不禁睁大了眼睛，向车门望去。 车厢里忽然传出一阵大笑，一个满身红如火的三尺童子，大笑着跳了出来。看她模样打扮，似乎是个女孩子，听那笑声，却又不似。只见她身子又肥又胖，双手又白又嫩，满头梳着十几条小辫子，根根冲天而立。身上穿的衣衫是红的，脚上的鞋子也是红的，面上却戴着咧着大嘴的火红鬼面，露出两只圆圆的眼睛，一眼望去，直似个火孩儿。柳玉茹当真骇了一跳，忍不住道：“方……方才就是你？” 那火孩儿嘻嘻笑道：“我家七姑娘还没有出来哩，你等着瞧吧，她可要比你漂亮多了。” 柳玉茹不想这孩子竟是人小鬼大，一下子就说穿了她心事，红着脸啐道：“小鬼头，谁管她漂不漂亮？……”话未说完，只见眼前人影一花，已有条白衣人影，俏生生站在红毡上。先不瞧她面貌长得怎样，单看她那窈窕的身子在那雪白的衣衫和鲜红的毛毡衬映之下，已显得那般神采飞扬，体态风流，何况她面容之美，更是任何话也描叙不出，若非眼见，谁也难信人间竟有如此绝色。 柳玉茹纵然目中无人，此刻也不免有些自惭形秽，暗起嫉妒之心，冷笑道：“不错，果然漂亮。但纵然美如天仙，也不能对仁义庄主无礼呀！姑娘你到底凭着什么？我倒想听听。” 白衣女子道：“你凭着什么想听，不妨先说出来再讲。”神情冷漠，语声冷漠，当真是艳如桃李，冷若冰霜。 李长青沉声道：“柳姑娘说的话，也就是老夫要说的话。” 白衣女道：“莫非你是生气了不成？” 李长青面寒如冰，一言不发，哪知白衣女却突然娇笑起来。她那冷漠的面色，一有了笑容，立时就变得说不出的甜蜜可爱，纵是铁石心肠的男人，也再难对她狠得下心肠，发得出脾气。只听她娇笑着伸出只春笋般的纤手，轻画着面颊，道：“羞羞羞，这么大年纪，还要跟小孩子发脾气，羞死人了。”满面娇态，满面调皮，方才她看来若有二十岁，此刻却已只剩下十一二岁了。 众人见她在刹那间便似换了个人，都不禁瞧得呆了，就连李长青都呆在地上，讷讷道：“你……你……” 平日言语那般从容之人，此刻竟是连一句话都说不出来。 白衣女发笑道：“李二叔，你莫非不认得我了？” 李长青道：“这……这的确有点眼拙。” 白衣女道：“九年前……你再想想……” 李长青皱着眉头道：“想不出。” 白衣女笑道：“我瞧你老人家真是老糊涂了。九年前一个下雨天，你老人家被淋得跟落汤鸡似的，到我家来……” 李长青脱口道：“朱……你可是朱家的千金？” 白衣女拍手笑道：“对了，我就是你老人家那天在大厅见到的哭着打滚要糖吃的女孩子……”她娇笑着，走过去，伸出纤手去摸李长青的胡子，娇笑着道：“你老人家若是还在生气，就让侄女给你消消气吧。你老人家要打就打，要骂就骂，谁教侄女是晚辈，反正总不能还手的。” 李长青闯荡江湖，经过不知多少大风大浪，见过不知多少厉害角色，但此刻对这女孩子，却当真是无计可施，方才心中的怒气一转眼便不知跑到哪里去了，苦笑着道：“唉，唉，日子过得真快，不想侄女竟已亭亭玉立了。令尊可安好么？” 白衣女笑道：“近年向他要钱的人，越来越多，他舍不得给，又不能不给，急得头发都白了。” 李长青想到她爹爹的模样，真被她三言两语刻画得人木三分，忍不住莞尔一笑，道：“九年前，老夫为了‘仁义庄’之事，前去向令尊求助，令尊虽然终于慨捐了万两黄金，但瞧他模样，却委实心痛得很……” 白衣女娇笑道：“你还不知道哩，你老人家走后，我爹爹还心痛了三天三夜，连饭都吃不下去，酒更舍不得喝了，总是要节省出补助万两黄金的损失，害得我们要吃肉，都得躲在厨房里吃……” 李长青开怀大笑，牵着她的小手，大步人厅。众人都被她风采所醉，不知不觉随着跟了进去，就连天法大师那般不苟言笑之人，此刻嘴角都有了笑容。 金不换走在最后，悄悄一拉徐若愚衣角道：“瞧这模样，这丫头似乎是‘活财神’，朱老头子的小女儿。” 徐若愚道：“必定不错。” 金不换道：“看来你我合作的机会已到了。” 徐若愚道：“合作什么？” 金不换诡笑道：“以徐兄之才貌，再加兄弟略使巧计，何愁不能使这小妞儿拜倒在徐兄足下？那时徐兄固是财色兼收，教武林中人人称羡，兄弟我也可跟在徐兄身后，占点小便宜。” 徐若愚面露喜色，但随即皱眉道：“这似乎有些……” 金不换目光闪动，瞧他神色有些迟疑立刻截口道：“有些什么？莫非徐兄自觉才貌还配不上人家，是以不敢妄动？” 徐若愚轩眉道：“谁说我不敢？” 金不换展颜一笑道：“打铁趁热，要动就得快点。” 突听身后一人骂道：“畜生，两个畜生！” 徐若愚、金不换两人一惊，齐地转身，只见那火孩儿，正叉腰站在他两人身后，瞪着眼，瞧着他们。 金不换怒骂道：“畜生，你骂什么？” 火孩儿道：“你是畜生！”突然跳起身子，反手一个耳光，动作之快，瞧都瞧不见，只听“啪”的一声，金不换左脸着了一掌。以他在江湖威名之盛，竟会被个小孩子一掌刮在脸上，那真是叫别人绝对无法相信之事。 金不换又惊又怒，大骂道：“小畜生！”伸开鸟爪般的手掌向前抓去，哪知眼前红影闪过，火孩儿早已掠人大厅里。 徐若愚道：“不好，咱们的话被这小鬼听了去。”他转过身子，竟似要溜，金不换一把抓着他道：“怕什么？计划既已决定，好歹也要干到底。” 徐若愚只得被他拖了进去，火孩儿已站到白衣女身边，见他两人进来，拍掌道：“两个畜生走进来了。” 李长青道：“咳，咳，小孩子不得胡说话。” 火孩儿又道：“他两人一搭一档，商量着要骗我家七姑娘，好人财两得。你老人家评评，这两人不是畜生是什么？” 李长青连连咳嗽，口中虽不说话，但目光已盯在他两人身上。徐若愚满面通红，金不换却仍是若无其事，洋洋自得。 白衣女七姑娘道：“这两位是谁？”她方才虽是满面笑容，但此刻神色又是冰冰冷冷，转眼间竟似换了个人。 柳玉茹眼珠子一转，抢先道：“这两位一个是‘见义勇为’金不换，他还有两个别号，一个是‘见钱眼开’，还有个是‘见利忘义’，但后面两个外号，远比前面那个出名得多了。” 七姑娘道：“也比前面那个妥切得多。” 金不换面不改色，抱拳道：“姑娘过奖了。” 柳玉茹“噗哧”一笑，道：“金兄面皮之厚，当真可称是天下无双，只怕连刀剑都砍不进。” 七姑娘道：“哼！还有个是谁？” 柳玉茹道：“还有一位更是大大有名，江湖人称‘玉面瑶琴神剑手’徐若愚。意思是看来虽‘若’很‘愚’，其实却是一点也不‘愚’的，反要比人都聪明得多。” 七姑娘凝目瞧了他半晌，突然放声娇笑起来，指着徐若愚笑道：“就凭这两人，也想吃天鹅肉么？可笑呀可笑，这种人也配算做武林七大高手，真难为别人怎么会承认的。”她笑得虽然花枝招展，说不出的娇媚，说不出的动听，但笑声中那分轻蔑之意，却委实教人难堪。 徐若愚苍白的面容，立刻涨得通红。 “雄狮”乔五恨声骂道：“无耻，败类。” 断虹子张开口来，“啐”地吐了口浓痰。天法大师面沉如水。柳玉茹轻叹道：“早知七大高手中有这样的角色，我倒真情愿没有被人列入这七大高手中了。”话未说完，徐若愚已转身奔了出去。 金不换虽是欺善怕恶，此刻也不禁恼羞成怒，暗道：“你这小妞儿纵然钱多，武功难道也能高过老子不成？老子少不得要教训教训你。”但他平生不打没把握的仗，虽觉自己定可稳操胜算，仍怕万一吃亏。心念数转，纵身追上了徐若愚，将他拉到门后。 徐若愚顿足道：“你……你害得我好苦，还拉我做什么？” 金不换冷冷道：“就这样算了？” 徐若愚恨声道：“不算了还要怎样？” 金不换皮笑肉不笑地瞧着他，缓缓道：“若换了是我，面对如此绝色佳人，打破头也要追到底的，若是半途而废，岂不教人耻笑？” 徐若愚怔了半晌，长叹道：“耻笑？唉……被人耻笑也说不得了。人家对我丝毫无意，我又怎么能……” 金不换叹着气截口道：“呆子，谁说她对你无意？” 徐若愚又自—怔，讷讷道：“但……但她若对我有意，又怎会……怎会那般轻视于我？唉，罢了罢了……”又待转身。 金不换叹道：“可笑呀可笑！女人的心意，你当真一点也不懂么？”不用别人去拉，徐若愚已又顿住脚步。金不换接着又道：“那女子纵然对你有意，当着大庭广众，难道还会对你求爱不成？” 徐若愚眨了眨眼睛，道：“这也有理……” 金不换道：“须知少女心情，最难捉摸。她越是对你有意，才越要折磨你，试试你是否真心。你若临阵脱逃，岂非辜负了别人一番美意？” 徐若愚大喜道：“有理有理！依兄台之意，小弟该当如何？” 金不换道：“方才咱们软来不成，此刻便来硬的。” 徐若愚道：“硬……硬的怎么行？” 金不换道：“这个你又不懂了。少女大多崇拜英雄，似你这样俊美人物，若是有英雄气概，还有谁能不睬你？” 徐若愚抚掌笑道：“不错不错！若非金兄指点，小弟险些误了大事。但……但到底如何硬法，还请金兄指教。” 金不换道：“只要你莫再临阵脱逃，坚持与我站在同一阵线就是，别的且瞧我的吧。”说罢转身而人。 徐若愚精神一振，整了整衣衫，大摇大摆随他走了进去。 大厅中李长青正在与那七姑娘谈笑。 这位七姑娘对李长青虽然笑语天真，但对别人却是都不理睬，就连天法大师此辈人物，都似未放在她眼里。群豪虽然对她颇有好感，但见她如此倨傲，心里也颇觉不是滋味。天法大师又白长身而起。他方才没有走成，此刻便又待拂袖而去。别人也有满腹闷气，既不能发作，也就想一走了之。 只听李长青道：“你此番出来，是无意经过此地，还是有心前来的？” 七姑娘娇笑道：“我本该说有心前来拜访你老人家，但又不能骗你老人家，你老人家可别生气。” 李长青捋髯大笑道：“好，好，如此你是无意路过的了。” 七姑娘道：“也不是，我是来找人的。” 李长青道：“谁？可在这里？” 七姑娘道：“就在这大厅里。” 群豪听了这句话，又都不禁打消了主意，只因大厅中只有这么几个人，大家都想瞧瞧这天下第一豪富活财神的千金，千里奔波，到底是来找谁？天法大师当先顿住脚步。他虽然修为功深，但那好胜好名之心，却半点也不后人，此刻竟忍不住暗忖道：“莫不是她久慕本座之名，是以专程前来求教？”转目望去，众人面上神情俱是似笑非笑，十分奇特，似乎也跟他有着同样的心思。 李长青目光闪动，含笑道：“当今天下高手，俱已在此厅之中，却不知贤侄女你要找的是谁？” 七姑娘也不回头，纤手向后一指，道：“他。” 群豪情不自禁，随着她手指之处望去，只见那根春笋般的纤纤玉指，指着的竟是一直缩在角落中不言不动的落魄少年。 七姑娘自始至终都未瞧他一眼，但此刻手指的方向，却是半点不差，显见她表面虽然未去瞧他，暗中已不知偷偷瞧过多少次了。群豪心里都有些失望：“原来她找的不是我。” “想不到这名不见经传的穷小子，竟能劳动如此美人的大驾。”这更使群豪不约而同地大为惊奇诧异，不知她为了什么，竟不远千里而来找他。 哪知落魄少年却干咳一声，长身而起，抱拳道：“晚辈告辞了。”话未说完，便待夺门而出。 突见红影一闪，那火孩儿已挡住了他，大声道：“好呀，你又想走！你难道不知我们七姑娘找你找得好苦？” 七姑娘咬着牙，顿足道：“好好，你……走，你，你走……你……你再走，我就……我就……”说着说着，眼圈就红了，声音也变了，话也无法继续。 落魄少年苦笑道：“姑娘何苦如此，在下……” 火孩儿双手叉腰，大叫道：“好呀，你个小没良心的，居然如此说话！你难道忘了七姑娘如何对待你……” 落魄少年又是干咳嗽，又是叹气；七姑娘又是跺足，又是抹泪。群豪却不禁瞧得又是惊奇，又是有趣。 此刻人人都已看出这位眼高于顶的七姑娘，竟对这落魄少年颇有情意，而这落魄少年反而不知消受美人恩，竟一心想逃走。 柳玉茹斜眼瞧着他，直皱眉头，暗道：“这倒怪了，天下的男人也未死光，七姑娘怎会偏偏瞧上这么块废料？” 李长青捋须望着这落魄少年，却更觉这少年实是不同凡响，而那女诸葛花四姑的目光，竟也和他一样。 大厅中的人忖思未已，这时金不换与徐若愚正大摇大摆走了进来，群豪见他两人居然厚着脸皮去而复返，都不禁大皱眉头。 雄狮乔五怒道：“你两人还想再来丢人么？” 金不换也不理他，笔直走到七姑娘身前，满面嬉皮笑脸抱拳道：“请了。” 徐若愚也立刻道：“请了。” 七姑娘正是满腔怨气无处发泄，狠狠瞪了他两人一眼，突然顿足大骂道：“滚，滚开些。” 徐若愚倒真吓了一跳，金不换却仍面不改色，笑嘻嘻道：“在下本要滚的，但姑娘有什么法子要在下滚，在下却想瞧瞧。”他一面说话，一面在背后连连向徐若愚摆手。 徐若愚立刻干咳一声，挺起胸膛，大声道：“金兄称雄武林，谁人不知，哪个不晓，你竟敢对他如此无礼，岂非将天下英雄都未瞧在眼里？”此人虽然耳根软，心不定，又喜自作聪明，但是口才确实不错，此时挺胸侃侃而言，倒端的有几分英雄气概。","tags":[{"name":"武林外传","slug":"武林外传","permalink":"http://jishusuishouji.github.io/tags/武林外传/"}]},{"title":"Spring中提示元素 'ref' 中不允许出现属性 'local'","date":"2017-01-17T07:58:44.000Z","path":"2017/01/17/spring/Spring中提示元素__ref__中不允许出现属性__local_/","text":"这个问题在Spring4.X以前的版本不存在。通过查询Spring的官方文档Spring4.X的以上版本不支持该属性了。下面是官方说明： The local attribute on the ref element is no longer supported in the 4.0 beans xsd since it does not provide value over a regular bean reference anymore. Simply change your existing ref local references to ref bean when upgrading to the 4.0 schema. 官方建议使用bean在Spring4.0以上的版本。 案例重现抛错：1234567891011121314151617181920212223242526272829303132333435363738394041Exception in thread &quot;main&quot; org.springframework.beans.factory.xml.XmlBeanDefinitionStoreException: Line 37 in XML document from class path resource [application_dependencies.xml] is invalid; nested exception is org.xml.sax.SAXParseException; lineNumber: 37; columnNumber: 27; cvc-complex-type.3.2.2: 元素 &apos;ref&apos; 中不允许出现属性 &apos;local&apos;。 at org.springframework.beans.factory.xml.XmlBeanDefinitionReader.doLoadBeanDefinitions(XmlBeanDefinitionReader.java:399) at org.springframework.beans.factory.xml.XmlBeanDefinitionReader.loadBeanDefinitions(XmlBeanDefinitionReader.java:336) at org.springframework.beans.factory.xml.XmlBeanDefinitionReader.loadBeanDefinitions(XmlBeanDefinitionReader.java:304) at org.springframework.beans.factory.support.AbstractBeanDefinitionReader.loadBeanDefinitions(AbstractBeanDefinitionReader.java:181) at org.springframework.beans.factory.support.AbstractBeanDefinitionReader.loadBeanDefinitions(AbstractBeanDefinitionReader.java:217) at org.springframework.beans.factory.support.AbstractBeanDefinitionReader.loadBeanDefinitions(AbstractBeanDefinitionReader.java:188) at org.springframework.beans.factory.support.AbstractBeanDefinitionReader.loadBeanDefinitions(AbstractBeanDefinitionReader.java:252) at org.springframework.context.support.AbstractXmlApplicationContext.loadBeanDefinitions(AbstractXmlApplicationContext.java:127) at org.springframework.context.support.AbstractXmlApplicationContext.loadBeanDefinitions(AbstractXmlApplicationContext.java:93) at org.springframework.context.support.AbstractRefreshableApplicationContext.refreshBeanFactory(AbstractRefreshableApplicationContext.java:129) at org.springframework.context.support.AbstractApplicationContext.obtainFreshBeanFactory(AbstractApplicationContext.java:604) at org.springframework.context.support.AbstractApplicationContext.refresh(AbstractApplicationContext.java:509) at org.springframework.context.support.ClassPathXmlApplicationContext.&lt;init&gt;(ClassPathXmlApplicationContext.java:139) at org.springframework.context.support.ClassPathXmlApplicationContext.&lt;init&gt;(ClassPathXmlApplicationContext.java:83) at com.mxsm.spring.SpringDependencies.main(SpringDependencies.java:64)Caused by: org.xml.sax.SAXParseException; lineNumber: 37; columnNumber: 27; cvc-complex-type.3.2.2: 元素 &apos;ref&apos; 中不允许出现属性 &apos;local&apos;。 at com.sun.org.apache.xerces.internal.util.ErrorHandlerWrapper.createSAXParseException(ErrorHandlerWrapper.java:198) at com.sun.org.apache.xerces.internal.util.ErrorHandlerWrapper.error(ErrorHandlerWrapper.java:134) at com.sun.org.apache.xerces.internal.impl.XMLErrorReporter.reportError(XMLErrorReporter.java:437) at com.sun.org.apache.xerces.internal.impl.XMLErrorReporter.reportError(XMLErrorReporter.java:368) at com.sun.org.apache.xerces.internal.impl.XMLErrorReporter.reportError(XMLErrorReporter.java:325) at com.sun.org.apache.xerces.internal.impl.xs.XMLSchemaValidator$XSIErrorReporter.reportError(XMLSchemaValidator.java:453) at com.sun.org.apache.xerces.internal.impl.xs.XMLSchemaValidator.reportSchemaError(XMLSchemaValidator.java:3232) at com.sun.org.apache.xerces.internal.impl.xs.XMLSchemaValidator.processAttributes(XMLSchemaValidator.java:2709) at com.sun.org.apache.xerces.internal.impl.xs.XMLSchemaValidator.handleStartElement(XMLSchemaValidator.java:2051) at com.sun.org.apache.xerces.internal.impl.xs.XMLSchemaValidator.emptyElement(XMLSchemaValidator.java:761) at com.sun.org.apache.xerces.internal.impl.XMLNSDocumentScannerImpl.scanStartElement(XMLNSDocumentScannerImpl.java:353) at com.sun.org.apache.xerces.internal.impl.XMLDocumentFragmentScannerImpl$FragmentContentDriver.next(XMLDocumentFragmentScannerImpl.java:2717) at com.sun.org.apache.xerces.internal.impl.XMLDocumentScannerImpl.next(XMLDocumentScannerImpl.java:607) at com.sun.org.apache.xerces.internal.impl.XMLNSDocumentScannerImpl.next(XMLNSDocumentScannerImpl.java:116) at com.sun.org.apache.xerces.internal.impl.XMLDocumentFragmentScannerImpl.scanDocument(XMLDocumentFragmentScannerImpl.java:489) at com.sun.org.apache.xerces.internal.parsers.XML11Configuration.parse(XML11Configuration.java:835) at com.sun.org.apache.xerces.internal.parsers.XML11Configuration.parse(XML11Configuration.java:764) at com.sun.org.apache.xerces.internal.parsers.XMLParser.parse(XMLParser.java:123) at com.sun.org.apache.xerces.internal.parsers.DOMParser.parse(DOMParser.java:237) at com.sun.org.apache.xerces.internal.jaxp.DocumentBuilderImpl.parse(DocumentBuilderImpl.java:300) at org.springframework.beans.factory.xml.DefaultDocumentLoader.loadDocument(DefaultDocumentLoader.java:76) at org.springframework.beans.factory.xml.XmlBeanDefinitionReader.doLoadDocument(XmlBeanDefinitionReader.java:429) at org.springframework.beans.factory.xml.XmlBeanDefinitionReader.doLoadBeanDefinitions(XmlBeanDefinitionReader.java:391) ... 14 more spring xml文件配置1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;beans xmlns=&quot;http://www.springframework.org/schema/beans&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xsi:schemaLocation=&quot;http://www.springframework.org/schema/beans http://www.springframework.org/schema/beans/spring-beans.xsd&quot;&gt; &lt;bean id=&quot;animals&quot; class=&quot;com.mxsm.spring.bean.Animal&quot;&gt; &lt;constructor-arg&gt; &lt;ref bean=&quot;dog&quot;/&gt; &lt;/constructor-arg&gt; &lt;constructor-arg&gt; &lt;ref bean=&quot;cat&quot;/&gt; &lt;/constructor-arg&gt; &lt;/bean&gt; &lt;!--使用type属性--&gt; &lt;bean id=&quot;dog&quot; class=&quot;com.mxsm.spring.bean.Dog&quot;&gt; &lt;constructor-arg type=&quot;java.lang.String&quot; value=&quot;aa&quot;/&gt; &lt;constructor-arg type=&quot;int&quot; value=&quot;1&quot;/&gt; &lt;constructor-arg type=&quot;java.lang.String&quot; value=&quot;meat&quot;/&gt; &lt;/bean&gt; &lt;bean id=&quot;dog_2&quot; class=&quot;com.mxsm.spring.bean.Dog&quot;&gt; &lt;constructor-arg index=&quot;0&quot; value=&quot;ssss&quot;/&gt; &lt;constructor-arg index=&quot;1&quot; value=&quot;3333&quot;/&gt; &lt;constructor-arg index=&quot;2&quot; value=&quot;8888&quot;/&gt; &lt;/bean&gt; &lt;bean id=&quot;cat&quot; class=&quot;com.mxsm.spring.bean.Cat&quot;&gt; &lt;constructor-arg name=&quot;a&quot; value=&quot;ssss&quot;/&gt; &lt;constructor-arg name=&quot;b&quot; value=&quot;3333&quot;/&gt; &lt;/bean&gt; &lt;!-- setter 依赖注入bean --&gt; **&lt;bean id=&quot;man&quot; class=&quot;com.mxsm.spring.bean.Man&quot;&gt; &lt;property name=&quot;white&quot;&gt; &lt;ref local=&quot;whiteMan&quot;/&gt; &lt;/property&gt; &lt;property name=&quot;yellow&quot;&gt; &lt;ref local =&quot;yellowMan&quot;/&gt; &lt;/property&gt; &lt;property name=&quot;id&quot; value=&quot;1&quot;/&gt; &lt;/bean&gt;** &lt;bean id=&quot;whiteMan&quot; class=&quot;com.mxsm.spring.bean.WhitePerson&quot;&gt; &lt;constructor-arg name=&quot;age&quot; value=&quot;1&quot;/&gt; &lt;constructor-arg name=&quot;color&quot; value=&quot;white&quot;/&gt; &lt;constructor-arg name=&quot;name&quot; value=&quot;USA&quot;/&gt; &lt;constructor-arg name=&quot;sex&quot; value=&quot;男&quot;/&gt; &lt;/bean&gt; &lt;bean id=&quot;yellowMan&quot; class=&quot;com.mxsm.spring.bean.YellowPerson&quot;&gt; &lt;constructor-arg name=&quot;age&quot; value=&quot;1&quot;/&gt; &lt;constructor-arg name=&quot;color&quot; value=&quot;yellow&quot;/&gt; &lt;constructor-arg name=&quot;name&quot; value=&quot;China&quot;/&gt; &lt;constructor-arg name=&quot;sex&quot; value=&quot;男&quot;/&gt; &lt;/bean&gt;&lt;/beans&gt;","tags":[{"name":"spring","slug":"spring","permalink":"http://jishusuishouji.github.io/tags/spring/"}]},{"title":"nodejs的require模块及路径","date":"2017-01-13T17:30:53.000Z","path":"2017/01/14/nodejs/nodejs的require模块及路径/","text":"在nodejs中，模块分为核心模块和文件模块。 核心模块是被编译成二进制代码，引用的时候只需require即可，如require(&#39;net&#39;)。文件模块，则是指js文件、json文件或者是.node文件。在引用文件模块的时候要加上文件的路径：如果既不加/.../...、../又不加./的话，则该模块要么是核心模块，要么是从一个node_modules文件夹加载。 如果’/home/ry/projects/foo.js‘ 中的文件调用了`require(‘bar.js’)`` ，node将在下面的位置进行搜索： •/home/ry/projects/node_modules/bar.js•/home/ry/node_modules/bar.js•/home/node_modules/bar.js•/node_modules/bar.js 文件夹作为模块：首先在./some-library文件夹下建立package.json文件，它标识了一个主模块。一个package.json中的内容可能如下：1234&#123; &quot;name&quot; : &quot;some-library&quot;, &quot;main&quot; : &quot;./lib/some-library.js&quot; &#125; require(&#39;./some-library&#39;)(和some-library相同路径的js文件)时将试图加载./some-library/lib/some-library.js如果在这个目录下没有package.json文件，node将试图从这个目录下加载index.js或index.node文件。例如，如果上面没有package.json文件，那么require(&#39;./some-library&#39;)时，将试图加载下面的文件：•./some-library/index.js•./some-library/index.node 分类: javascript,nodejs标签: javascript, nodejs","tags":[{"name":"nodejs","slug":"nodejs","permalink":"http://jishusuishouji.github.io/tags/nodejs/"}]},{"title":"Spring MVC事务配置","date":"2017-01-09T14:36:01.000Z","path":"2017/01/09/java/spring/Spring_MVC事务配置/","text":"","tags":[]},{"title":"是该抛弃Spring HibernateTemplate的时候了","date":"2017-01-09T14:26:48.000Z","path":"2017/01/09/java/spring/是该抛弃Spring_HibernateTemplate的时候了/","text":"在spring2.0之前，我们在使用hibernate和spring的时候，都会被HibernateTemplate为我们提供benefits（资源和事务管理以及把那个“丑陋”的checked exception转换为runtime exception-DataAccessException ）而折服，在项目中不由自主、不假思索地使用它和那个经典的callback方法。而如今，hibernate3.0.1+ 、spring 2.0+版本以后，我们可以在数据访问层直接使用hinberate的session API(例如SessionFactory.getCurrentSession)，不并担心session和transaction management。至于error handling可以通过spring的@Repository annotation和post processor-PersistenceExceptionTranslationPostProcessor来解决。让我们来看一些代码片段：123456789&lt;bean id=&quot;sessionFactory&quot; class=&quot;org.springframework.orm.hibernate3. LocalSessionFactoryBean&quot;&gt; &lt;!-- the properties setting--&gt; &lt;/bean&gt; &lt;bean id=&quot;accountRepo&quot; class=&quot;com.mycompany.HibernateAccountRepository&quot;&gt; &lt;constructor-arg ref=&quot;sessionFactory&quot;&gt;&lt;/constructor-arg&gt; &lt;/bean&gt; &lt;bean class=&quot;org.springframework.dao.annotation. PersistenceExceptionTranslationPostProcessor&quot;/&gt; 数据访问层代码片段：123456789101112131415@Repository public class HibernateAccountRepository implements AccountRepository &#123; private SessionFactory factory; public HibernateAccountRepository(SessionFactory factory) &#123; this.factory = factory; &#125; public Account loadAccount(String username) &#123; return (Account)factory.getCurrentSession() .createQuery(&quot;from Account acc where acc.name = :name&quot;) .setParameter(&quot;name&quot;, &quot;thethirdpart&quot;).uniqueResult(); &#125; &#125; 在xml配置文件里面通过配置的post processor会自动检测@Repository标注的bean并为该bean打开exception转换功能。 如果不支持annotations，可以通过AOP来实现，更方便123456&lt;bean id=&quot;persistenceExceptionInterceptor&quot; class=&quot;org.springframework.dao.support.PersistenceExceptionTranslationInterceptor&quot;/&gt; &lt;aop:config&gt; &lt;aop:advisor pointcut=&quot;execution(* *..*Repository+.*(..))&quot; advice-ref=&quot;persistenceExceptionInterceptor&quot; /&gt; &lt;/aop:config&gt; 总结，我们应该选择哪种方式呢？还是那句话，根据不同的情况来做最正确的选择。但我建议是丢弃template，而直接使用hibernate的API，毕竟灵活性更大，更何况遇到复杂的情况我们始终得面对hibernate的API。spring并不强制你做任何事情，记得它是一个非侵入性的framework。","tags":[{"name":"spring","slug":"spring","permalink":"http://jishusuishouji.github.io/tags/spring/"},{"name":"java","slug":"java","permalink":"http://jishusuishouji.github.io/tags/java/"}]},{"title":"So should you still use Spring's HibernateTemplate and/or JpaTemplate??","date":"2017-01-09T14:20:51.000Z","path":"2017/01/09/java/spring/So_should_you_still_use_Spring_s_HibernateTemplate_and_or_JpaTemplate__/","text":"I was reading an article by Vigil Bose on TSS the other day and saw the usage of the HibernateDaoSupport class. Since this is no longer a recommended way of using Hibernate from Spring, I thought I might as well just blog about it another time. 不建议使用HibernateDaoSupport。 With the advent(n. 到来；出现；) of Spring 2.0, it has become possible to start using the Hibernate Session API directly again. The question is whether or not it is wise to abandon the use of the HibernateTemplate when working with Hibernate, or any other template-based approaches Spring features. Using Spring XxxTemplatesIn Spring 1.0, we introduced a revolutionary way of working with data access APIs that threw checked exceptions. The template approach Spring features along with its transaction synchronization manager and the extensive(adj. 广泛的；大量的；广阔的) use of runtime exceptions makes any TCFTC (short for try/catch-finally-try/catch as we coined(杜撰) it back in 2005) often found in data access code entirely obsolete. Below you can see (a simplified version and not entirely precise version of) what Spring’s template approach does for you (with specific code snippets that you would otherwise have to write). Acquisition of connection: If transaction synchronization is active (which it is, if you’re using Spring’s transaction management infrastructure), most of the times any of the Spring templates are using the same connection across the entire thread (things are actually a bit more complicated than that, but that would lead us too much into the gory details). Participation in a transaction Again, when using transaction management features, Spring will automatically associated any new connection with the current transaction. This again, all depends on the current propagations settings and so on, but whichever way you look at it, your core code is not affected by it. Specification of the SQL: This is what you (obviously) have to do yourself. The SQL ideally uses bind parameters, to avoid any chances of SQL injection from happening. Parameters are passed to the JDBC template as arguments. Creation / execution of statement and iterating over result set: After you’ve specified the SQL, Spring is going to create the statement for you, set any parameters you may have specified, execute it and loop over the result set for you. Parse result from result set: You can opt for parsing the result set yourself if you like (or if you have complex parsing requirements), or you can have Spring result a list of primitives, or just one value from the result set. Handling and translation of exceptions: This is where Spring translates any exceptions that might have occurred to Spring’s own DataAccessException hierarchy, automatically insulating calling code from the data access technology in use. Releasing of connection: This is the last piece of the puzzle where Spring releases any resources used. Of course, if transaction synchronization is active, the resources might not be released immediately. Templates are available for several APIs such as: JDBC (JdbcTemplate) Hibernate (HibernateTemplate) iBatis (SqlMapClientTemplate) JDO (JdoTemplate) TopLink (TopLinkTemplate) Messaging (JmsTempate) Transaction management (TransactionTemplate) JNDI (JndiTemplate) Are templates really necessary?The templates add a lot of value when using an API that uses checked exceptions (as opposed to runtime exceptions or unchecked exceptions), but also add a lot of consistency to your code base. People having learnt Spring’s JdbcTemplate can pretty easily start using Spring’s JdoTemplate or Spring’s HibernateTemplate–the approach to using those is similar for each one of them. The most visible impact of the Spring template approach is the code reduction for for example JDBC. This is primarily because the checked exceptions are translated to runtime exceptions inside the template, removing the need to catch the exception in your mainline code. Other reasons are the transparent resource management and automatic synchronization with the currently running transaction. Of course it’s fairly easy to change a framework to use runtime exceptions natively instead of Spring having to do this and this is what for example Hibernate has started to do from version 3.0 onwards. Hibernate is not the only technology to do this–the Java Persistence API is also using runtime exceptions.","tags":[{"name":"spring","slug":"spring","permalink":"http://jishusuishouji.github.io/tags/spring/"},{"name":"java","slug":"java","permalink":"http://jishusuishouji.github.io/tags/java/"},{"name":"hibernate","slug":"hibernate","permalink":"http://jishusuishouji.github.io/tags/hibernate/"},{"name":"HibernateTemplate","slug":"HibernateTemplate","permalink":"http://jishusuishouji.github.io/tags/HibernateTemplate/"}]},{"title":"java分布式事务(JTA)实现 jotm和atomikos","date":"2017-01-08T02:03:52.000Z","path":"2017/01/08/java/jta/java分布式事务_JTA_实现 jotm和atomikos/","text":"本地事务：只对单一数据源(单个数据库)事务进行控制。分布式事务：处理多种异构的数据源， 比如某个业务操作中同时包含JDBC和JMS或者某个操作需要访问多个不同的数据库，在不同数据库之间进行事务控制。 在Java中，分布式事务主要的规范是JTA/XA。其中：JTA是Java的事务管理器规范，XA是工业标准的X/Open CAE规范，可被两阶段提交及回滚的事务资源定义。比如某数据库实现了XA规范，则不管是JTA，还是MSDTC，都可以基于同样的行为对该数据库进行事务处理。 JTA全称为Java Transaction API，顾名思义JTA定义了一组统一的事务编程的接口，这些接口如下： XAResource：XAResource接口是对实现了X/Open CAE规范的资源管理器 (Resource Manager，数据库就是典型的资源管理器) 的抽象，它由资源适配器 (Resource Apdater) 提供实现。XAResource是支持事务控制的核心。Transaction：Transaction接口是一个事务实例的抽象，通过它可以控制事务内多个资源的提交或者回滚。二阶段提交过程也是由Transaction接口的实现者来完成的。TransactionManager：托管模式 (managed mode) 下，TransactionManager接口是被应用服务器调用，以控制事务的边界的。UserTransaction：非托管模式 (non-managed mode) 下，应用程序可以通过UserTransaction接口控制事务的边界 在tomcat下是没有分布式事务的，可以借助于第三方Jotm和Automikos实现，在spring中分布式事务是通过jta（jotm，atomikos）来进行实现。即：通过代码的方式来决定是否是分布式事务。 注：推荐用服务器自己的数据源(也就是 lookup JNDI)，这样的话，是不是XA事务就由服务器的配置来定制，代码就不需要任何配置来决定是不是XA了。事务本身是不是XA (分布式的）是服务器的事，服务器来管理“资源” （包括数据源，JMS 连接等，一个资源（JDBC连接）如何参与事务是“资源管理器”（驱动程序）的职责，跟程序无关），服务器提供事务管理并作为“事务协调者”来处理多个“资源管理器”（不同的数据库连接）之间的事务一致性。 jotm和automikos网址：1、http://jotm.objectweb.org/2、http://www.atomikos.com/Main/TransactionsEssentials Spring 通过AOP技术可以让我们在脱离EJB的情况下享受声明式事务的丰盛大餐。此外，通过配合使用ObjectWeb的JOTM开源项目，不需要Java EE应用服务器，Spring也可以提供JTA事务。 正因为AOP让Spring拥有了脱离EJB容器的声明式事务能力，而JOTM让我们在脱离Java EE应用服务器下拥有JTA事务能力。所以，人们将AOP和JOTM称为Java软件开发的两个圣杯。 JTA的实现框架有：GeronimoTM/Jencks 官方文档比较少，不适合学习和维护。SimpleJTA 没有实现JTS (Java Transaction Service)而且不是活跃的。Atomikos 是一个另人钦佩的产品。有丰富的文档，而且有很好的支持。JBossTS 是一个应用在JBOSS服务器上的，肯定是一个成熟的产品，也有好的支持，详细信息可以看这里：http://www.theserverside.com/news/thread.tss?thread_id=37941最常见的二个如下：JOTM JOTM(Java Open Transaction Manager)是ObjectWeb的一个开源JTA实现，它本身也是开源应用程序服务器JOnAS(Java Open Application Server)的一部分，为其提供JTA分布式事务的功能。 存在的问题：使用中不能自动rollback，无论什么情况都commit。注：spring3开始已经不再支持jotm Atomikos 大家推荐最多的。和JOTM相比Atomikos Transactions Essentials更加稳定，它原来是商业项目，现在开源了。象MySQL一样卖服务支持的。而且论坛页比较活跃，有问题很快可以解决。","tags":[{"name":"java","slug":"java","permalink":"http://jishusuishouji.github.io/tags/java/"},{"name":"jta","slug":"jta","permalink":"http://jishusuishouji.github.io/tags/jta/"},{"name":"分布式事务","slug":"分布式事务","permalink":"http://jishusuishouji.github.io/tags/分布式事务/"},{"name":"jotm","slug":"jotm","permalink":"http://jishusuishouji.github.io/tags/jotm/"},{"name":"atomikos","slug":"atomikos","permalink":"http://jishusuishouji.github.io/tags/atomikos/"}]},{"title":"java分布式事务:spring+JTA+jotm","date":"2017-01-08T01:23:24.000Z","path":"2017/01/08/java/jta/java分布式事务_spring_JTA_jotm/","text":"业务背景当新建用户时需插入一条用户记录，同时还需在另一个DB中记录日志。因为是不同的DB操作，所以及到分布式事务的处理。 1、代码结构： 2、建表语句：1234567create database log; DROP TABLE IF EXISTS `log`; CREATE TABLE `log` ( `id` varchar(20) NOT NULL, `content` varchar(100) default NULL, PRIMARY KEY (`id`) ); 1234567create database user; DROP TABLE IF EXISTS `user`; CREATE TABLE `user` ( `id` varchar(20) NOT NULL, `name` varchar(40) default NULL, PRIMARY KEY (`id`) ); 3、配置文件application.xml12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061626364656667686970717273&lt;!--?xml version=1.0 encoding=UTF-8?--&gt; &lt;beans aop=&quot;&quot; beans=&quot;&quot; http:=&quot;&quot; schema=&quot;&quot; spring-aop.xsd=&quot;&quot; spring-beans.xsd=&quot;&quot; spring-tx.xsd=&quot;&quot; tx=&quot;&quot; www.springframework.org=&quot;&quot; xmlns=&quot;http://www.springframework.org/schema/beans&quot; xmlns:aop=&quot;http://www.springframework.org/schema/aop&quot; xmlns:tx=&quot;http://www.springframework.org/schema/tx&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xsi:schemalocation=&quot;http://www.springframework.org/schema/beans&quot;&gt; &lt;!-- 引用Spring内部所提供的对JOTM支持的工厂类 --&gt; &lt;bean class=&quot;org.springframework.transaction.jta.JotmFactoryBean&quot; id=&quot;jotm&quot;/&gt; &lt;!-- 配置JTA事务管理器, 并在管理器中使用上面所配置的JOTM --&gt; &lt;bean class=&quot;org.springframework.transaction.jta.JtaTransactionManager&quot; id=&quot;txManager&quot;&gt; &lt;property name=&quot;userTransaction&quot; ref=&quot;jotm&quot;/&gt; &lt;/bean&gt; &lt;!-- 配置多个数据源 --&gt; &lt;bean class=&quot;org.enhydra.jdbc.pool.StandardXAPoolDataSource&quot; destroy-method=&quot;shutdown&quot; id=&quot;db1&quot;&gt; &lt;property name=&quot;dataSource&quot;&gt; &lt;bean class=&quot;org.enhydra.jdbc.standard.StandardXADataSource&quot; destroy-method=&quot;shutdown&quot;&gt; &lt;property name=&quot;transactionManager&quot; ref=&quot;jotm&quot;/&gt; &lt;property name=&quot;driverName&quot; value=&quot;com.mysql.jdbc.Driver&quot;/&gt; &lt;property name=&quot;url&quot; value=&quot;jdbc:MySQL://localhost:3306/user&quot;/&gt; &lt;/bean&gt; &lt;/property&gt; &lt;property name=&quot;user&quot; value=&quot;root&quot;/&gt; &lt;property name=&quot;password&quot; value=&quot;root&quot;/&gt; &lt;/bean&gt; &lt;bean class=&quot;org.enhydra.jdbc.pool.StandardXAPoolDataSource&quot; destroy-method=&quot;shutdown&quot; id=&quot;db2&quot;&gt; &lt;property name=&quot;dataSource&quot;&gt; &lt;bean class=&quot;org.enhydra.jdbc.standard.StandardXADataSource&quot; destroy-method=&quot;shutdown&quot;&gt; &lt;property name=&quot;transactionManager&quot; ref=&quot;jotm&quot;/&gt; &lt;property name=&quot;driverName&quot; value=&quot;com.mysql.jdbc.Driver&quot;/&gt; &lt;property name=&quot;url&quot; value=&quot;jdbc:MySQL://localhost:3306/log&quot;/&gt; &lt;/bean&gt; &lt;/property&gt; &lt;property name=&quot;user&quot; value=&quot;root&quot;/&gt; &lt;property name=&quot;password&quot; value=&quot;root&quot;/&gt; &lt;/bean&gt; &lt;!-- 根据不同的数据源配置两个jdbcTemplate --&gt; &lt;bean class=&quot;org.springframework.jdbc.core.JdbcTemplate&quot; id=&quot;jdbcTemplate1&quot;&gt; &lt;property name=&quot;dataSource&quot; ref=&quot;db1&quot;/&gt; &lt;/bean&gt; &lt;bean class=&quot;org.springframework.jdbc.core.JdbcTemplate&quot; id=&quot;jdbcTemplate2&quot;&gt; &lt;property name=&quot;dataSource&quot; ref=&quot;db2&quot;/&gt; &lt;/bean&gt; &lt;bean class=&quot;com.zdp.dao.UserDao&quot; id=&quot;userDao&quot;&gt; &lt;property name=&quot;jdbcTemplate&quot; ref=&quot;jdbcTemplate1&quot;/&gt; &lt;/bean&gt; &lt;bean class=&quot;com.zdp.dao.LogDao&quot; id=&quot;logDao&quot;&gt; &lt;property name=&quot;jdbcTemplate&quot; ref=&quot;jdbcTemplate2&quot;/&gt; &lt;/bean&gt; &lt;bean class=&quot;com.zdp.service.UserService&quot; id=&quot;userService&quot;/&gt; &lt;property name=&quot;userDao&quot; ref=&quot;userDao&quot;/&gt; &lt;property name=&quot;logDao&quot; ref=&quot;logDao&quot;/&gt; &lt;/bean&gt; &lt;!-- JTA事务传播特性 --&gt; &lt;tx:advice id=&quot;txAdviceJTA&quot; transaction-manager=&quot;txManager&quot;&gt; &lt;tx:attributes&gt; &lt;tx:method isolation=&quot;DEFAULT&quot; name=&quot;save*&quot; propagation=&quot;REQUIRED&quot; rollback-for=&quot;Exception/&quot;&gt; &lt;tx:method isolation=&quot;DEFAULT&quot; name=&quot;add*&quot; propagation=&quot;REQUIRED&quot; rollback-for=&quot;Exception/&quot;&gt; &lt;tx:method isolation=&quot;DEFAULT&quot; name=&quot;create*&quot; propagation=&quot;REQUIRED&quot; rollback-for=&quot;Exception/&quot;&gt; &lt;tx:method isolation=&quot;DEFAULT&quot; name=&quot;insert*&quot; propagation=&quot;REQUIRED&quot; rollback-for=&quot;Exception/&quot;&gt; &lt;tx:method isolation=&quot;DEFAULT&quot; name=&quot;del*&quot; propagation=&quot;REQUIRED&quot; rollback-for=&quot;Exception/&quot;&gt; &lt;tx:method isolation=&quot;DEFAULT&quot; name=&quot;update*&quot; propagation=&quot;REQUIRED&quot; rollback-for=&quot;Exception/&quot;&gt; &lt;tx:method name=&quot;*&quot; read-only=&quot;true/&quot;&gt; &lt;/tx:attributes&gt; &lt;/tx:advice&gt; &lt;/beans&gt; 4、service业务类：1234567891011121314151617181920212223242526public class UserService &#123; private UserDao userDao; private LogDao logDao; public void saveUser(String id, String name) &#123; userDao.insertUser(id, name); // int i = 1 / 0; // 制造异常 logDao.insertLog(id, id + _ + name); &#125; public UserDao getUserDao() &#123; return userDao; &#125; public void setUserDao(UserDao userDao) &#123; this.userDao = userDao; &#125; public LogDao getLogDao() &#123; return logDao; &#125; public void setLogDao(LogDao logDao) &#123; this.logDao = logDao; &#125; &#125; 5、dao类：123456public class UserDao extends JdbcDaoSupport &#123; public void insertUser(String id, String name) &#123; JdbcTemplate template = getJdbcTemplate(); template.execute(insert into user values(&apos; + id + &apos;,&apos; + name + &apos;)); &#125; &#125; 123456public class LogDao extends JdbcDaoSupport &#123; public void insertLog(String id, String content) &#123; JdbcTemplate template = getJdbcTemplate(); template.execute(insert into log values(&apos; + id + &apos;,&apos; + content + &apos;)); &#125; &#125; 6、测试类：12345678public class UserTest &#123; @Test public void testSave() &#123; ApplicationContext cxt = new ClassPathXmlApplicationContext(ApplicationContext.xml); UserService us = (UserService) cxt.getBean(userService); us.saveUser(1, zhangsan); &#125; &#125;","tags":[{"name":"spring","slug":"spring","permalink":"http://jishusuishouji.github.io/tags/spring/"},{"name":"java","slug":"java","permalink":"http://jishusuishouji.github.io/tags/java/"},{"name":"jta","slug":"jta","permalink":"http://jishusuishouji.github.io/tags/jta/"},{"name":"jotm","slug":"jotm","permalink":"http://jishusuishouji.github.io/tags/jotm/"}]}]